<template>
  <div class="body">
    <div id="carouselExampleRide" class="carousel slide" data-bs-ride="carousel">
      <div class="carousel-indicators">
        <button type="button" data-bs-target="carouselExampleIndicators" data-bs-slide-to="0" class="active"
          aria-current="true" aria-label="Slide 1"></button>
        <button type="button" data-bs-target="carouselExampleIndicators" data-bs-slide-to="1"
          aria-label="Slide 2"></button>
          <button type="button" data-bs-target="carouselExampleIndicators" data-bs-slide-to="2"
          aria-label="Slide 3"></button>
          <button type="button" data-bs-target="carouselExampleIndicators" data-bs-slide-to="3"
          aria-label="Slide 4"></button>
      </div>
      <div class="carousel-inner">
        <div class="carousel-item" v-for="(item, index) in items" :key="index" :class="{ active: index === 0}" data-bs-interval="3000">
          <img :src="item.img" class="carousel-img d-block w-100" />
        </div>
      </div>
      <button class="carousel-control-prev" type="button" data-bs-target="#carouselExampleRide" data-bs-slide="prev">
        <span class="carousel-control-prev-icon" aria-hidden="true"></span>
        <span class="visually-hidden">Previous</span>
      </button>
      <button class="carousel-control-next" type="button" data-bs-target="#carouselExampleRide" data-bs-slide="next">
        <span class="carousel-control-next-icon" aria-hidden="true"></span>
        <span class="visually-hidden">Next</span>
      </button>
    </div>
    <div class="list" v-for="(item, index) in items" :key="index">
      <ListItem :item="item"></ListItem>
    </div>
  </div>
</template>

<script>
import ListItem from '../components/ListItem.vue'
export default {
  name: 'myHome',
  props: ['url'],
  components:{
    'ListItem':ListItem
  },
  data(){
    return{
      items:[
        {name:"80天环游地球", img:require("@/assets/img/book/80天环游地球.jpg"), detail:"《八十天环游地球》是法国著名作家“科幻小说之父”儒勒·凡尔纳最受欢迎的长篇小说之一。这个故事说的是100多年前，英国有位先生叫福格，他要挑战一个不可能的任务，那就是用80天的时间绕地球一圈。当时的所有人，都觉得这位先生在吹牛。那么这位先生后来完成了这个任务吗？他在旅途中发生了哪些稀奇古怪的事情呢？", update:"2025-07-28", list: ['故事1：一场让人吃惊的打赌','故事2：新仆人被他的主人吓坏了','故事3：警探认为福格先生是小偷','故事4：警探没有逮捕证','故事5：万事通把警探当成好朋友','故事6：在孟买发生的奇怪事','故事7：福格先生买了只大象','故事8：森林里遇到可怕的人','故事9：要被烧死的女人','故事10：他们被警察抓了起来','故事11：主人为万事通付了一大笔钱','故事12：菲克斯警探又跟上了他们','故事13：菲克斯的身份好像被看穿','故事14：晚了24小时到香港','故事15：万事通被灌醉耽误了大事','故事16：福格先生打算坐小船去上海','故事17：小帆船遇到了大风暴','故事18：万事通成了横滨街头的流浪汉','故事19：长鼻子的万事通','故事20：万事通和菲克斯仇人相见','故事21：一场可怕的选举','故事22：野牛挡住了火车','故事23：阿乌达看见了不想见到的人','故事24：火车前面的桥快塌了','故事25：福格先生要和上校决斗','故事26：强盗爬上了火车','故事27：福格去强盗那儿找万事通','故事28：去纽约的艰难路程','故事29：遇到去法国的小船','故事30：福格先生自己开起了船','故事31：福格先生想要烧船','故事32：福格又被警察抓起来了','故事33：福格和阿乌达表达爱意','故事34：俱乐部里焦急的等待','故事35：大结局']},
        {name:"金银岛", img:require("@/assets/img/book/金银岛.jpg"), detail:"《金银岛》的作者是英国的罗伯特·史蒂文森。故事的主人公是个十岁大的小男孩吉姆，他因为一个偶然的机会，得到了一张藏宝图。兴奋的小男孩决定和镇上的医生一同出海去一个小岛上寻找宝藏。他们还找来了一批水手，想让他们帮着一起去寻宝。后来，在这群寻宝人之间，发生了一系列惊险刺激的故事。", update:"2025-06-18",list:['故事1：奇怪的客人','故事2：神秘的水手箱','故事3：危险的旅店','故事4：油布包里的藏宝图','故事5：出发前的准备','故事6：瘸腿水手和黑狗','故事7：船长的担心','故事8：神秘的西尔弗','故事9：一场巨大的危机','故事10：看见小岛','故事11：偷偷上岛','故事12：荒岛探险','故事13：被流放的海盗','故事14：和伙伴重逢','故事15：一个新伙伴','故事16：紧张的登岛之旅','故事17：第一次交战','故事18：致命的危机','故事19：西尔弗来谈判了','故事20：寨子被攻击','故事21：胜利的代价','故事22：找到小船','故事23：砍断大船的缆绳','故事24：海上漂流','故事25：登上大船','故事26：吉姆船长','故事27：鹿死谁手','故事28：回到寨子','故事29：西尔弗投降','故事30：海盗内讧','故事31：医生来了','故事32：海盗寻宝','故事33：树林里的怪声','故事34：消失的宝藏','故事35：宝藏的下落','故事36：大结局']},
        {name:"神秘岛", img:require("@/assets/img/book/神秘岛.jpg"), detail:"《神秘岛》是法国科幻小说家儒勒·凡尔纳创作的长篇小说，是其三部曲的第三部。故事叙述在美国南北战争时期，几个被困在南军中的北方人，中途被风暴吹落在太平洋中的一个荒岛上，他们团结互助，建立起幸福的生活；直到格兰特船长的儿子罗伯尔所指挥的“邓肯号” 经过那里时，才把他们搭救。", update:"2025-07-08", list: ['神秘岛1：狂风中的氢气球','神秘岛2：有人不见了','神秘岛3：危险的逃跑计划','神秘岛4：小岛上的呼唤','神秘岛5：游到对岸','神秘岛6：叫“烟囱”的新家','神秘岛7：消失的火柴盒','神秘岛8：清点物资','神秘岛9：钓松鸡','神秘岛10：暴风雨来临','神秘岛11：沙丘里的秘密','神秘岛12：死里逃生','神秘岛13：神秘的脚印','神秘岛14：没有火，打猎有用么？','神秘岛15：登山探路','神秘岛16：征服者','神秘岛17：前面在冒烟','神秘岛18：造弓箭烧砖头','神秘岛19：测算小岛的位置','神秘岛20：快乐的铁匠','神秘岛21：托普和“美人鱼”搏斗','神秘岛22：发明炸药','神秘岛23：花岗岩宫殿','神秘岛24：改造新家','神秘岛25：珍贵的小麦种子','神秘岛26：一连串怪事','神秘岛27：神秘的箱子','神秘岛28：搜索落难人','神秘岛29：西海岸之旅','神秘岛30：发现老朋友','神秘岛31：入侵者','神秘岛32：新伙伴','神秘岛33：捕鲸船玛利亚号','神秘岛34：眺望岗被袭击','神秘岛35：森林里小木屋','神秘岛36：带回野人','神秘岛37：难以捉摸的野人','神秘岛38：野人的过去','神秘岛39：天大的遗憾','神秘岛40：有船来了','神秘岛41：登船计划','神秘岛42：和海盗开战','神秘岛43：集体撤退','神秘岛44：沉船之谜','神秘岛45：做好事的神秘人','神秘岛46：危机四伏的小岛','神秘岛47：和海盗搏斗','神秘岛48：又有坏消息','神秘岛49：眺望岗着火','神秘岛50：从天而降的神秘物','神秘岛51：再次探险','神秘岛52：发现海盗','神秘岛53：寻找神秘人','神秘岛54：神秘的电报','神秘岛55：原来是他！','神秘岛56：揭秘真相','神秘岛57：永远地告别','神秘岛58：火山喷发','神秘岛59：灭顶之灾','神秘岛60：陷入绝望','神秘岛61：大结局']},
        {name:"格列弗游记", img:require("@/assets/img/book/格列弗游记.jpg"), detail:"《格列佛历险记》，是英国作家乔纳森·斯威夫特创作的一部长篇游记体讽刺小说，它讲述了一个叫格列佛的小伙子，一直怀揣着航海梦。为了实现梦想，格列佛数次离开家乡出门远游。在乘船出海的途中，格列佛遇到了各种各样意外，流落到了许多不为人知的奇特国家，大人国，小人国，飞岛国，马国。未知的旅途危险重重，格列佛的生命频频遭受威胁，聪明勇敢的他该如何渡过难关呢?", update:"2025-07-18", list: [['1：惊险的航海旅行（上）','2：惊险的航海旅行（下）','3：误闯小人国（上）','4：误闯小人国（下）','5：前往京城（上）','6：前往京城（下）','7：口袋里的秘密（上）','8：口袋里的秘密（下）','9：荒唐的危险游戏（上）','10：荒唐的危险游戏（下）','11：重获自由（上）','12：重获自由（下）','13：小人国的危机（上）','14：小人国的危机（下）','15：英雄巨人山（上）','16：英雄巨人山（下）','17：王宫救火大显身手（上）','18：王宫救火大显身手（下）','19：可怕的报复（上）','20：可怕的报复（下）','21：离开小人国（上）','22：离开小人国（下）','23：大人国奇遇（上）','24：大人国奇遇（下）','25：可怕的午餐时间（上）','26：可怕的午餐时间（下）','27：决战大老鼠（上）','28：决战大老鼠（下）','29：痛苦的卖艺生活（上）','30：痛苦的卖艺生活（下）','31：脱离苦海（上）','32：脱离苦海（下）','33：王宫里的新生活（上）','34：王宫里的新生活（下）','35：被巨人国矮子捉弄（上）','36：被巨人国矮子捉弄（下）','37：首都一日游（上）','38：首都一日游（下）','39：危险的生活（上）','40：危险的生活（下）','41：小矮人闹出大笑话（上）','42：小矮人闹出大笑话（下）','43：格列佛的祖国（上）','44：格列佛的祖国（下）','45：飞来横祸（上）','46：飞来横祸（下）','47：惊险的木箱漂流（上）','48：惊险的木箱漂流（下）','49：异样的回归（上）','50：异样的回归（下）','51：海盗夺船（上）','52：海盗夺船（下）','53：飞岛国奇遇（上）','54：飞岛国奇遇（下）','55：地洞里的秘密（上）','56：地洞里的秘密（下）','57：国王镇压动乱（上）','58：国王镇压动乱（下）','59：首都人都是糊涂蛋（上）','60：首都人都是糊涂蛋（下）','61：荒唐的科学研究（上）','62：荒唐的科学研究（下）','63：登上巫师岛（上）','64：登上巫师岛（下）','65：召见历史上的名人（上）','66：召见历史上的名人（下）','67：舔地面上的尘土（上）','68：舔地面上的尘土（下）','69：神秘的布鲁格人（上）','70：神秘的布鲁格人（下）','71：遭遇海盗（上）','72：遭遇海盗（下）','73：古怪的动物（上）','74：古怪的动物（下）','75：马儿统治的慧骃国（上）','76：马儿统治的慧骃国（下）','77：留在慧骃国（上）','78：留在慧骃国（下）','79：格列佛介绍祖国（上）','80：格列佛介绍祖国（下）','81：野胡们的恶习（上）','82：野胡们的恶习（下）','83：慧骃的美德（上）','84：慧骃的美德（下）','85：悲伤的分离（上）','86：悲伤的分离（下）','87：漂泊的格列佛（上）','88：漂泊的格列佛（下）','89：大结局（上）','90：大结局（下）']]},
      ]
      //items:[{}]
    }
  }
}
</script>

<style lang="less" scoped>
.body {
  width: 100vw;
  height: calc(100vh - 22vw);
  background-color: white;
  overflow-y: auto;
}

.carousel {
  .carousel-item {
    background-size: contain;
    background-repeat: no-repeat;
    background-position: center;
    width: 100vw;
    height: 100vw;

    .carousel-img {
      width: 100vw;
      height: 100vw;
      object-fit: cover;
    }
  }
  
  .card{
    width: 100vw;
    height: 20vh;
    background-color: pink;
    text-align: center;
  }
}
</style>
