<template>
  <div class="body">
    <div id="carouselExampleRide" class="carousel slide" data-bs-ride="carousel">
      <div class="carousel-indicators">
        <button type="button" data-bs-target="carouselExampleIndicators" data-bs-slide-to="0" class="active"
          aria-current="true" aria-label="Slide 1"></button>
        <button type="button" data-bs-target="carouselExampleIndicators" data-bs-slide-to="1"
          aria-label="Slide 2"></button>
        <button type="button" data-bs-target="carouselExampleIndicators" data-bs-slide-to="2"
          aria-label="Slide 3"></button>
      </div>
      <div class="carousel-inner">
        <div class="carousel-item" v-for="(item, index) in items" :key="index" :class="{ active: index === 0}" data-bs-interval="3000">
          <img :src="item.img" class="carousel-img d-block w-100" />
        </div>
      </div>
      <button class="carousel-control-prev" type="button" data-bs-target="#carouselExampleRide" data-bs-slide="prev">
        <span class="carousel-control-prev-icon" aria-hidden="true"></span>
        <span class="visually-hidden">Previous</span>
      </button>
      <button class="carousel-control-next" type="button" data-bs-target="#carouselExampleRide" data-bs-slide="next">
        <span class="carousel-control-next-icon" aria-hidden="true"></span>
        <span class="visually-hidden">Next</span>
      </button>
    </div>
    <div class="list" v-for="(item, index) in items" :key="index">
      <ListItem :item="item"></ListItem>
    </div>
  </div>
</template>

<script>
import ListItem from '../components/ListItem.vue'
export default {
  name: 'myHome',
  props: ['url'],
  components:{
    'ListItem':ListItem
  },
  data(){
    return{
      items:[
        {name:"植物大战之山河之旅", img:require("../assets/img/book/山河之旅.png"), detail:"植物小分队与僵尸战队乘坐各自的交通工具，要来一场知识竞赛，他们以长城为起点环游中国通过收集知识，升级他们的交通工具，探索中国的山山水水，游历一座座壮观的古建筑，破解中华文明的古老密码。让小朋友学习地理、历史、生物等科学知识的同时，增强环境、文物、文化保护意识，培养孩子的责任感，提升勇气与智慧。", update:"2025-04-29", list: ['01 疯狂的赌约','02 知识热气球','03 神奇的石头房子','04 僵尸当好汉','05 不懂历史真可怕','06 数呀数房间','07 好运名字','08 紫禁城的由来','09 华丽的屋顶','10 寻找皇帝的卧室','11 故宫内廷大发现','12 皇宫里面吃大餐','13 A计划','14 千龙吐水','15 找相同','16 老师也犯错','17 买礼物','18 长廊奔跑大赛','19 开不走的豪华船','20 大桥十七孔','21 祭祀套餐','22 神奇数字9','23 声音真奇妙','24 停不下来的拍手游戏','25 真假祈年殿','26 时间柱子','27 山洞里的神秘人','28 珍贵的火种','29 石器制造能手','30 骨针力量大','31 读报力量大','32 皇帝与石碑','33 无敌气球鞋','34 鞋子里的法宝','35 多功能假山','36 向日葵的好运气','37 动力系统坏了','38 热河泉','39 一万块香蕉皮','40 功夫不负有心人','41 知识的味道','42 了不起的五岳','43 规则大升级','44 泰山老大哥','45 桃花朵朵红','46 十八盘的台阶','47 通往天上的大门','48 孔老师纪念馆','49 僵尸战队大救援','50 “真龙”现身','51 知识飞艇来啦','52 孔府大作战','53 立在院子里的门','54 神奇大扫除','55 僵尸爱陵墓','56 鞠躬的威力','57 美丽的园林城市','58 建座花园给自己','59 追踪大怪物','60 猜不透的隐身术','61 僵尸小队长的疑问','62 保护珍稀小鸟','63 可怕的意外','64 好朋友丹顶鹤','65 优雅的舞者','66 “四不像”麋鹿','67 最佳拍档','68 断桥残雪','69 登雷锋塔比赛','70 身在湖边不知湖','71 关于西湖的传说','72 西湖赛诗','73 知识大丰收','74 古老的水坝','75 白云收集行动','76 大雨下不停','77 邪恶云','78 圆形大飞碟','79 土楼之王','80 谁说得对？','81 火炬树桩的条件','82 岛屿上的怪力','83 钢琴岛','84 植物小分队重聚','85 云彩马甲','86 园子里的大海','87 两个博物馆','88 令人崩溃的惩罚','89 偷马甲与抢马甲','90 望庐山瀑布','91 装甲车再现','92 马甲变彩色','93 背诗小能手','94 黄山真奇妙','95 月亮徽章','96 西递宏村大对决','97 牛身上的旅行','98 选择困难症','99 大禹治水','100 石窟保卫战','101 当心大水怪','102 龟甲兽骨上刻字','103 这口锅不一般','104 谁先启动转盘','105 偏心的转盘','106 骑车去嵩山','107 周公测影台','108 大科学家郭守敬','109 少林寺在哪儿','110 中岳庙之谜','111 三位大将军','112 消失的火炬树桩','113 谁留下的水印','114 有味道的古城','115 瓮城诡计','116 超大县衙门','117 代理小队长','118 第一位皇帝','119 奇迹陶俑','120 徽章争夺大战','121 野人的故乡','122 坚果的金丝猴朋友','123 山顶黑影','124 一朵奇怪的云','125 飞向武当山','126 温柔的功夫','127 徽章磨成针','128 铁杵磨成针','129 想念僵尸小队长','130 金殿的谎言','131 大山相貌真奇特','132 搜寻大鱼','133 娃娃鱼不是鱼','134 最折磨人的惩罚','135 这个土司不能吃','136 系统归零','137 转移面包','138 防僵尸神器','139 不分胜负的争吵','140 澳门是个好地方','141 Macao的由来','142 保护郑家大屋','143 开启你问我答','144 教堂多又多','145 大牌坊的故事','146 火炬树桩的谜题','147 跳舞的红人儿','148 僵尸口袋','149 向日葵的山水画','150 谁创造了桂林山水','151 溶洞真奇妙','152 惩罚僵尸博士','153 口袋变手套','154 万年智慧圣地','155 胡话里的重要信息','156 四方街奇遇','157 冲街习俗','158 木先生的大房子','159 奇怪的植物小分队','160 披肩里的秘密','161 玉龙雪山','162 不一样的雕塑展','163 蘑菇房主人','164 三条大江并着流','165 植物变成照片了','166 小队长之吻','167 探寻三江源头','168 帽天山变大海','169 水下竞赛开始','170 寒武纪生命大爆发','171 没有输赢的比赛','172 山上有个感叹号','173 寺庙收集计划','174 佛像怎么睡觉','175 套僵尸','176 大足石刻','177 催个不停大法','178 夜半阴谋','179 拿走大熊猫的竹子','180 无奈的交换','181 青城山走马观花','182 天才水利发明','183 不明飞行物来啦','184 峨眉好武功','185 僵尸战队遇险记','186 山一样的大佛像','187 僵尸之神','188 郑重的承诺','189 童话王国派对','190 无人区追踪','191 布达拉宫找朋友','192 大神变变变','193 大昭寺与拉萨城','194 飞毛腿棒极了','195 僵尸们的画作','196 路障僵尸办糗事','197 有楼层的大山','198 一个坏消息','199 小小作文有妙用','200 辉煌的废墟']},
        {name:"植物大战之海盗大斗法", img:require("../assets/img/book/海盗大斗法.png"), detail:"植物学校放暑假了，火炬树桩校长组织植物们出海旅行，豌豆射手、菜问、向日葵等植物都报名参加，从来没有见过大海的樱桃炸弹兄弟也跃跃欲试。在这次航行中，意外遭遇海盗僵尸，一路和海盗僵尸斗智斗勇，途中他们还经历了暴风雨、海怪、火山爆发、暗礁群、龙卷风等等意外，在风土人情各异的海岛遇到不同的困难和挑战，最后植物们终于找到了传说能获得智慧与勇气的“宝藏”。", update:"2025-04-29",list:['1.暑假计划','2.游轮出海','3.遭遇海盗','4.狂风暴雨','5.流落荒岛','6.寻找水源','7.求救信号','8.狭路相逢','9.互相帮助','10.大力奇迹','11.鹦鹉传话','12.再起风波','13.海怪来袭','14.小兵大功','15.恐怖海峡','16.海洋旋涡','17.玫瑰陷阱','18.失踪之谜','19.独眼怪兽','20.意外重逢','21.生死之交','22.一条大鱼','23.小猴芒克','24.下马威','25.攀登圣山','26.千年寒潭','27.悬崖峭壁','28.智斗毒蛇（上）','29.智斗毒蛇（下）','30.新王诞生','31.新的难题','32.樱桃威力','33.久别重逢','34. 大显身手','35.手到擒来','36.失而复得','37.你追我赶','38.清清泉水','39.花香小岛','40.火山巨人','41.初见大师','42.偷闯王宫','43.二见大师','44.火山底下','45.惊天秘密','46.揭露真相','47.国王驾到','48.相信科学','49.大师逃走','50.美味特产','51.亲自出马','52.找到美味','53.自食其力','54.重新出发','55.海市蜃楼','56.遇到暗礁','57.海上迷雾','58.雾中探路','59.雾中打斗','60.救助海龟','61.走出暗礁','62.狭路相逢','63.寻找木头','64.海龟报恩','65.再次合作','66.你争我夺','67.蓝色果实','68.调虎离山','69.吸取教训','70.拭目以待','71.一无所获','72.事不过三','73.风云再起','74.风雨无阻','75.樱桃侦探','76.谁是小偷','77.大鸟求救','78.小鬼僵尸','79.一斗大鸟','80.二斗大鸟','81.三斗大鸟','82.乐极生悲','83.围攻失败','84.给个教训','85.意外发现','86.消化不良','87.虎口夺食','88.争先恐后','89.愿者上钩','90.小岛沉没','91.救命武器','92.见死不救','93.举手表决','94.安然无恙','95.黄金小岛','96.智力大赛','97.组团参赛','98.镜子迷宫','99.鹦鹉带路','100.走出迷宫','101.智力竞赛','102.惨遭淘汰','103.甜蜜糖果','104.连得两分','105.装满大厅','106.生熟鸡蛋','107.最后一关','108.千片拼图','109.只差一片','110.集体作弊','111.免费大餐','112.神奇海火','113.银花浪花','114.渔夫撒网','115.抽签下海','116.独吞宝藏','117.久别重逢','118.答应求助','119.坦诚相告','120.惊动怪物','121.怪物生气','122. 一条腕足','123.攻击转向','124. 火烧章鱼','125.同时遇险','126.鹦鹉发威','127.飞索僵尸','128.僵尸求助','129.坚果好虫','130.万箭齐发','131.神秘女王','132.心狠手辣','133.苦命劳工','134.美味烤鱼','135.一无所获','136.宝石陷阱','137.菜问中招','138.新的线索','139.谜面谜底','140.蚂蚁安安','141.蜻蜓小队','142.秘密武器','143.分配任务','144.声东击西','145.趁虚而入','146.解救蜻蜓','147.屁滚尿流','148.威逼利诱','149.可乘之机','150.分头行动','151.迫在眉睫','152.大打出手','153.有功之臣','154.将计就计','155.地下通道','156.找到蚁后','157.落荒而逃','158.卷土重来','159.恕不奉陪','160.大获全胜','161.功不可没','162.人鱼传说','163.另辟蹊径','164.销魂歌声','165.人鱼波波','166.秘密计划','167.狐狸尾巴','168.人鱼妈妈','169.珍珠眼泪','170.一声尖叫','171.不翼而飞','172.意外落水','173.确实倒霉','174.长点教训','175.求助波波','176.尾随其后','177.铁链缠身','178.人鱼国王','179.追忆往事','180.绿色明珠','181.出乎意料','182.沙漠之舟','183.山洞壁画','184.追忆往事','185.寻找喷泉','186.泉水干枯','187.谁的功劳','188.地图换水','189.意外遇险','190.逃脱流沙','191.梦幻森林','192.白日做梦','193.谁是谁非','194.心心念念','195.走出森林','196.误入王宫','197.发现国王','198.不同的门','199.又见人鱼','200.重返家园']},
        {name:"植物大战僵尸之功夫世界", img:require("../assets/img/book/功夫世界.png"), detail:"故事结合孩子们最喜欢的时空穿越与冒险元素，融入大量奇思妙想的创意，彻底放飞想象力，精彩刺激乐不停。小朋友们，和我们一起坐上时空穿越车潘妮，跟随疯狂的戴夫、勇敢的豌豆射手和其它植物伙伴们，开启一段跌宕起伏的功夫世界之旅吧!", update:"2025-04-29",list:['1.功夫世界的来客（上）','2.功夫世界的来客（下）','3.到功夫世界冒险（上）','4.到功夫世界冒险（中）','5.到功夫世界冒险（下）','6.胆小的师父（上）','7.胆小的师傅（下）','8.真人不露相','9.新式武器','10.潜入僵尸博士总部','11.僵尸博士真正的阴谋','12.僵尸出动了？','13.灵山寺的立体影像','14.戴夫的谈判（上）','15.戴夫的谈判（下）','16.双拳难敌四手','17.生力军增援','18.目标，变了又变','19.戴夫逃跑了','20.樱桃炸弹登场','21.僵尸们的围追堵截','22.疯狂的逃亡','23.勇敢的奉献与牺牲','24.潘妮坠毁了','25.下游的“绿尖头”','26.被三兄弟暴打的戴夫','27.青笋寨','28.竹笋老寨主','29.暂时的休整','30.翻脸的老寨主','31.重要的锦囊（上）','32.重要的锦囊（下）','33.香果镇的悲剧','34.僵尸们的全面进攻','35.神奇戴夫，死而复生','36.苹果里的希望之星（上）','37.苹果里的希望之星（下）','38.火葫芦的火焰猛攻','39.暴走！功夫酒鬼僵尸','40.突然出现的强援','41.奇迹！潘妮回来了','42.植物们强有力的反击','43.僵尸博士的超级武器','44.布阵吧，伙伴们','45.异时空黑洞开启','46.白萝卜大师终于登场','47.分工明确的作战计划','48.胜利的歌声','49.胜利的欢庆','50.完美的大结局','51.重返功夫世界','52.回到现实世界','353战斗一触即发','54.神秘的蓝光旋涡','55.又一台时空传送机','56.降落美国西部','57.第一波正面交战','58.神秘的红色豆子','59.闪电芦苇车队','60.凌厉的闪电攻击','61.红色闪光豆再出山','62.探寻红色豆子的秘密（上）','63.探寻红色豆子的秘密（下）','64.雷雨交加西行路','65.一会儿哭一会儿笑的戴夫','66.与龙卷风擦肩而过','67.刚出生的新成员','68.向日葵的治愈歌声','69.诡异的小镇','70.被僵尸包围','71.穿越车边的战斗','72.戴夫和豌豆射手归队','73.无敌的骑牛牛仔小鬼僵尸','74.闪电芦苇的电击治疗','75.变成蜗牛车的潘妮','76.望梅止渴','77.遭遇沙暴','78.断水断粮的日子','79.回旋镖射手登场','80.抵达咕噜镇','81.入侵的淘金僵尸','82.咕噜镇保卫战','83.动身前往金矿区','84.超级英雄们的战斗','85.可怕的超级钢铁巨人','86.早就计划好的大爆炸','87.继续冒险','88.汽车开进了大海里','89.登上”伊丽莎白“号','90.海盗僵尸的威胁','91.没有钱，没有船','92.与僵尸船狭路相逢','93.与海盗僵尸正面对决','94.打退敌人','95.百变茄子狮子大开口','96.大蒜先生的餐厅','97.椰子湾港口遇袭','98.主动加入的巴豆船长','99.皇家旗舰瓦尔基里号','100.瓦尔基里号的威力','101.海盗僵尸惨败弃船','102.打不完的僵尸','103.改道巫师岛','104.海盗僵尸的秘密埋伏','105.卖豆子的“巫师”','106.跟踪海鸥僵尸','107.营救能量花行动','108.尾随僵尸海盗船','109.大发明家戴夫的改造','110.一头扎进海盗船','111.关键时刻又掉链子','112.竟然是陷阱','113.屋漏偏逢连夜雨','114.闪电芦苇大爆发','115.海上救人记','116.时空穿越机的蓝光','117.兵分两路','118.潜水艇下潜的极限','119.制造一个海底旋涡','120.科学不能马虎','121.“小岛”的本来面貌','122.一千门小鬼僵尸炮','123.困难的局面','124.椰子加农炮成功逃脱','125.豌豆射手担任指挥官','126.计划开始','127.僵尸博士丢了遥控器','128.救人状况频发','129.火龙草船长失踪了','130.从天而降的大网','131.炮弹炸膛','132.大蒜先生出走了','133.等来援军','134.第二套作战方案（上）','135.第二套作战方案（下）','136.愚蠢的僵尸博士','137.海盗小鬼僵尸弹打光了','138.吹响反击的号角','139.众叛亲离的僵尸博士','140.僵尸博士又逃跑了','141.再次踏上征程','142抵达利比亚沙漠','143.最大的植物都市','144.突破城门的难题','145.乔装打扮进城去','146.匆忙逃跑的闪电芦苇','147.第一场战斗','148.太阳神的使者','149.“神使”的伟大计划','150.真正的神使大人','151.神使大人的精彩推理','152.僵尸博士空降古埃及（上）','153.僵尸博士空降古埃及（下）','154.以退为进','155.看守严密的阳光仓库','156.最严密的防守','157.成立突击队','158.突击队行动','159.好钢用在刀刃上','160.表演叠罗汉','161.豌豆射手投降了？','162.运筹帷幄的豌豆射手','163.逃出生天','164.僵尸博士的美梦','165.准备撤退','166.无形的蓝光墙','167.护卫队长就得挨打','168.迁移行动开始','169.第二梯队，出击！','170.再坚持一小时','171.愤怒的僵尸博士','172.重选队长','173.声东击西','174.僵尸军团转向了','175.尼罗河避难','176.闪电惊雷霹雳棒（上）','177.闪电惊雷霹雳棒（下）','178.小能量花出生了','179.国王啊，您在哪里（上）','180.国王啊，您在哪里（中）','181.国王啊，您在哪里（下）','182.看守王陵的黑甲虫','183.打不倒的沙子人','184.国王满嘴胡话','185.30分钟后，王宫爆炸','186.僵尸军团反攻','187.超级电棍秒杀','188.闪电芦苇的反攻','189.我们回家吧','190.终极大盘点']}
      ]
      //items:[{}]
    }
  }
}
</script>

<style lang="less" scoped>
.body {
  width: 100vw;
  height: calc(100vh - 22vw);
  background-color: white;
  overflow-y: auto;
}

.carousel {
  .carousel-item {
    background-size: contain;
    background-repeat: no-repeat;
    background-position: center;
    width: 100vw;
    height: 50vw;

    .carousel-img {
      width: 100vw;
      height: 50vw;
      object-fit: cover;
      /* 或 contain，看需求 */
    }
  }
  
  .card{
    width: 100vw;
    height: 20vh;
    background-color: pink;
    text-align: center;
  }
}
</style>
