<template>
  <div class="body">
    <div id="carouselExampleRide" class="carousel slide" data-bs-ride="carousel">
      <div class="carousel-indicators">
        <button type="button" data-bs-target="carouselExampleIndicators" data-bs-slide-to="0" class="active"
          aria-current="true" aria-label="Slide 1"></button>
        <button type="button" data-bs-target="carouselExampleIndicators" data-bs-slide-to="1"
          aria-label="Slide 2"></button>
        <button type="button" data-bs-target="carouselExampleIndicators" data-bs-slide-to="2"
          aria-label="Slide 3"></button>
        <button type="button" data-bs-target="carouselExampleIndicators" data-bs-slide-to="3"
          aria-label="Slide 4"></button>
        <button type="button" data-bs-target="carouselExampleIndicators" data-bs-slide-to="4"
          aria-label="Slide 5"></button>
      </div>
      <div class="carousel-inner">
        <div class="carousel-item" v-for="(item, index) in items" :key="index" :class="{ active: index === 0}" data-bs-interval="3000">
          <img :src="item.img" class="carousel-img d-block w-100" />
        </div>
      </div>
      <button class="carousel-control-prev" type="button" data-bs-target="#carouselExampleRide" data-bs-slide="prev">
        <span class="carousel-control-prev-icon" aria-hidden="true"></span>
        <span class="visually-hidden">Previous</span>
      </button>
      <button class="carousel-control-next" type="button" data-bs-target="#carouselExampleRide" data-bs-slide="next">
        <span class="carousel-control-next-icon" aria-hidden="true"></span>
        <span class="visually-hidden">Next</span>
      </button>
    </div>
    <div class="list" v-for="(item, index) in items" :key="index">
      <ListItem :item="item"></ListItem>
    </div>
  </div>
</template>

<script>
import ListItem from '../components/ListItem.vue'
export default {
  name: 'myHome',
  props: ['url'],
  components:{
    'ListItem':ListItem
  },
  data(){
    return{
      items:[
        {name:"植物大战僵尸之飞跃侏罗纪", img:require("@/assets/img/book/飞跃侏罗纪.png"), detail:"糟糕，戴夫被困在侏罗纪了!植物们决定前去营救这位老朋友。坐上“破烂者号”飞跃车，豌豆射手、金盏花、仙桃和大嘴花穿越到了遥远的中生代。在侏罗纪的森林里，他们居然遇见了会吐冰的莱索托龙和会喷火的近蜥龙。究竟是未知的神秘物种，还是离奇的基因变异?植物们经过一番探索，终于在海底发现了一处秘密基地", update:"2025-05-8", list: ['01 奇怪的蟑螂','02 求救电话','03 寻找线索','04 下定决心','05 破烂者号','06 变身过山车','07 穿越时空隧道','08 沼泽遇险_上','09 沼泽遇险_下','10 发现恐龙','11 遇见莱索托龙','12 如此包扎','13 寒冰之气','14 意想不到的危机','15 误会一场','16 偷袭','17 幕后高手','18 钢铁桃子','19 无人机','20 基因变异','21 伪装计划','22 抓捕 攻击性强的恐龙','23 棱背龙的防御系统','24 水陆两用装甲车','25 混入海底城堡','26 话痨相逢','27 恐龙的血液','28 出师未捷','29 水滴石穿','30 戴夫卡住了','31 通风管道大逃生','32 从天而降的救兵','33 大战冰脊龙','34 逃之夭夭','35 邪恶计划','36 建造穿越轨道','37 离开侏罗纪','38 毁灭植物镇？','39 僵尸变异啦','40 紧急撤退','41 戴夫回来了！','42 狼狈的僵尸博士']},
        {name:"植物大战僵尸之寻宝侏罗纪", img:require("../assets/img/book/寻宝侏罗纪.jpg"), detail:"向日葵梦想成为一名宝藏猎人，在戴夫的帮助下，她追寻着爷爷的脚步，穿越到亿万年前的侏罗纪，开始了一场神奇的寻宝之旅。在这个时代，向日葵不仅需要跟同样穿越而来的僵尸斗智斗勇，还不得不想办法与众多恐龙相处，一路上向日葵和小伙伴坚果、菜问一起帮助小马门溪龙找妈妈，与剑龙一起逃脱森林火海，还差点儿成为永川龙口中的美食。想办法拥有梦想，是一件幸福的事情，而追逐梦想，则无比艰辛，需要勇气与智慧。在菜问和坚果的帮助下，向日葵能否为了梦想坚持到最后呢?一起来听听看吧!", update:"2025-05-18",list:['01 逃命的小恐龙','02 我的梦想','03 向日葵的藏宝图','04 发错了地方','05 向日葵路遇小希','06 高大的鲸龙','07 哭泣的蛮龙','08 狭路相逢','09 秘密武器，登场','10 二段变身','11 紧急逃生','12 剑龙危机','13 漫天大火','14 以火攻火','15 前往，红杉海','16 凶恶的翼龙','17 悲伤三人组','18 母子重逢','19 宝藏藏深山','20 一步也走不动了','21 大餐揭秘','22 危险陷阱','23 永川龙来啦','24 拯救坚果大行动','25 巨大的蝴蝶?','26 霸王食人花','27 因祸得福','28 洞中有洞','29 宝石守护者','30 刀枪不入','31 新一轮攻击','32 传送阵，打开','33 步入绝境','34 地下河','35 植物镇大英雄']},
        {name:"植物大战僵尸之魔力神卡", img:require("../assets/img/book/魔力神卡.png"), detail:"古希腊神话有着弥足轻重的地位，它将现实生活与幻想交织在一起，为人们创造了一个包罗万象的瑰丽世界，具有非凡的文学与艺术魅力。古希腊神话中有哪些著名的天神?他们又有哪些经典的神话故事?和植物小分队一起穿越魔法宝石隧道，来到神秘莫测的奥林波斯山，认识性格迥异的十二天神，一同经历别样的神话故事!", update:"2025-05-29",list:['01.神秘的盒子','02.魔盒里的“宝贝”','03.植物镇大危机','04.魔法宝石隧道','05.奥林波斯派对','06.炉火边的女神','07.守护圣火','08.赫斯提亚的善良神卡','09.雅典娜的头号粉丝','10.天神打架','11.向日葵的妙计','12.城市守护神','13.耶！两张神卡','14.“小偷”天神','15.僵尸博士的歪脑筋','16.植物僵尸大PK','17.发怒的赫尔墨斯','18.护送七弦琴','19.音乐挑战','20.僵尸摇滚乐','21.植物管弦乐','22.奥林波斯山大变样','23.德墨忒尔的伤心事','24.神奇的石榴籽','25.宙斯的决断','26.阿瑞斯的比武擂台','27.植物小战僵尸','28.勇气神卡','29.寻找下一张神卡','30.跛脚的天神','31.火神的烦恼','32.璀璨的礼物','33.赫拉回心转意','34.特别的婚礼','35.金苹果之争','36.最美的女神（上）','37.最美的女神（下）','38.美丽神卡','39.冒牌先知','40.狩猎女神的原则','41.一个新祭司','42.爱记仇的赫拉','43.煽风点火','44.赫拉造反','45.第十一张神卡','46.希望钥匙','47.僵尸的报应','48.拯救植物镇']},
        {name:"植物大战僵尸之植物侦探团", img:require("../assets/img/book/植物侦探团.jpg"), detail:"植物学校即将组建兴趣社团，豌豆射手凭借自己超强的分析推理能力，征服了所有同学，拿到了首个建团名额，成立了一个无比神奇的社团--植物侦探团。向日葵、菜问都凭借过人的本领成了侦探团的首批成员，坚果却被拒之门外……为了加人社团，坚果必须找到三个案件，他能成功吗?", update:"2025-06-11",list:['01.创意社团征集','02.遭遇质疑','03.推理，大显身手（上)','04.推理，大显身手（下）','05.第一名成员','06.三人侦探团','07.第一个案件，出现','08.案情回溯中','09.可疑的僵尸二人组','10.引发了争端','11.警长和大法官','12.公开庭审（上）','13.公开庭审（下）','14.豌豆射手，出马！','15.反客为主！','16.精彩的攻防对垒','17.校长的真实身份','18.戒指，找到了！','19.推理的过程','20.坚果继续努力','21.太阳神僵尸的吆喝','22.一喝就聪明营养液','23.铁丝能点燃？','24.蚂蚁会写字？','25.书费变葫芦','26.又来十个宝葫芦','27.复制实验','28.案件告破！','29.同一事件，不同版本','30.丁香几个花瓣','31.自由市场上的法庭','32.油能溶于水吗？','33.金币的真正主人','34.正义，不求回报']},
        {name:"植物大战僵尸之全能大侦探", img:require("../assets/img/book/全能大侦探.jpg"), detail:"在第1季《植物侦探团》的故事里，植物侦探团成功破获了戒指失踪案，营养液案、钱包归属案三大案件。豌豆射手的植物侦探团可谓声名鹊起。今年，植物学校竟然聘用了一位僵尸--舞者僵尸当外聘老师，随后就发生了失踪案，绑架案.….这些案件的背后到底隐藏着什么可怕的阴谋?豌豆射手的植物侦探团绝不能袖手旁观，这次，他们能破解真相吗?", update:"2025-06-18",list:['01.来了明星教师（上）','02.来了明星教师（下）','03.小喷菇，失踪了？','04.曲折的小巷','05.防盗门的密码','06.摩擦起电与摩擦力','07.小喷菇是安全的！','08.抓住了，跟踪者！','09.冰箱里藏着的线索','10. 重走模拟路线','11.旧仓库血迹斑斑','12.小路旁的雪橇车','13.仗义的雪橇车僵尸','14.破案的全过程','15.向校长道歉','16. 真正的绑架案','17.戴夫的宝藏仓库（上）','18. 戴夫的宝藏仓库（下）','19.万吨手环','20. 最适合的探案道具','21.消极破案','22.吃遍所有餐馆','23.五个图案的真正含义','24.独角鳄鱼？','25.过河的危险','26.渡河计划','27.草丛里，有蛇？','28.陡然生变','29. 浮潜僵尸','30.惊现案中案！','31. 让石头飞一会儿','32. 勇猛无敌的菜问','33.寻找坐标的路','34.第六棵树','35.吊在树上的舞者僵尸','36.太阳窝棚过夜','37.自导自演的恶作剧','38.杠杆原理','39.海边城堡旅馆','40.粗中有细的菜问','41.去而复返','42.201,202房间','43. 夹层中的密室','44.隐蔽的机关','45.麻醉喷罐','46.甬道的尽头','47.找到了，仙人掌','48.初战告捷','49.有原则的僵尸','50.僵尸博士的真正阴谋','51.侦探团，再度出马','52.混元霹雳太水门门主','53.营养液？大力丸？','54.豪华大擂台','55.击掌为誓','56.观众挑战大力士？','57.拔河（上）','58.拔河（下）','59.掌门登台','60.太水门的拳法','61.坚果被选中了！','62.一招打倒十四人','63.决斗开始','64.意料之中','65.神秘的颁奖嘉宾','66.一石激起千层浪','67. 周旋（上）','68. 周旋（下）','69.案件重现','70.骗子的伎俩','71.全是假的','72.假拳案！结案陈词','73.免费送鸡蛋？','74.“微服私访”（上）','75.“微服私访”（中）','76. “微服私访”（下）','77.养生？骗局！','78.全员VIP 1','79.列队欢迎','80.开始套路','81.体验！VIP服务','82.属于自己的星星（上）','83.属于自己的星星（下）','84.这里有熟人','85.理疗第一阶段','86.中途的诱惑','87. 抵达！冥想之城','88.冥想小屋','89.越来越多的线索','90.无根之水和天上飞花','91.虚弱的倭瓜厨师','92.开启撤退计划','93.休闲区体验（上）','94.休闲区体验（下）','95. 休闲区的高消费','96.可怕的高利贷','97.微信！布置任务','98.车轮上的黄色粉末','99.公路上绕圈圈','100.车到悬崖','101.警报拉响','102.惊险！夺城门','103.抢夺遥控器','104. 战斗，初步胜利！','105.自食恶果','106.突然停车了','107.不惜开战','108.最坏的情况','109.临时法庭再登场','110.证词（上）','111.证词（下）','112.神奇的排毒','113.电解水实验','114.气体的真正成分','115. 神秘老者登场','116.不见棺材不掉泪','117.揭露连环骗局','118.血泪控诉（上）','119.血泪控诉（下）','120.宣判！正义时刻']}

      ]
      //items:[{}]
    }
  }
}
</script>

<style lang="less" scoped>
.body {
  width: 100vw;
  height: calc(100vh - 22vw);
  background-color: white;
  overflow-y: auto;
}

.carousel {
  .carousel-item {
    background-size: contain;
    background-repeat: no-repeat;
    background-position: center;
    width: 100vw;
    height: 100vw;

    .carousel-img {
      width: 100vw;
      height: 100vw;
      object-fit: cover;
      /* 或 contain，看需求 */
    }
  }
  
  .card{
    width: 100vw;
    height: 20vh;
    background-color: pink;
    text-align: center;
  }
}
</style>
