// src/data/bookList.js
export const resource = {
  "bookList": [
    {
      name: '植物大战僵尸故事', 
      path:'/PlantsZombis', 
      list:[      
        {finished: true, type:'audio', name:"飞跃侏罗纪", img:"/img/book/PlantsZombies/飞跃侏罗纪.png", detail:"糟糕，戴夫被困在侏罗纪了!植物们决定前去营救这位老朋友。坐上“破烂者号”飞跃车，豌豆射手、金盏花、仙桃和大嘴花穿越到了遥远的中生代。在侏罗纪的森林里，他们居然遇见了会吐冰的莱索托龙和会喷火的近蜥龙。究竟是未知的神秘物种，还是离奇的基因变异?植物们经过一番探索，终于在海底发现了一处秘密基地", update:"2025-05-8", 
          list: [
            '01 奇怪的蟑螂','02 求救电话','03 寻找线索','04 下定决心','05 破烂者号','06 变身过山车','07 穿越时空隧道','08 沼泽遇险_上','09 沼泽遇险_下','10 发现恐龙','11 遇见莱索托龙','12 如此包扎','13 寒冰之气','14 意想不到的危机','15 误会一场','16 偷袭','17 幕后高手','18 钢铁桃子','19 无人机','20 基因变异','21 伪装计划','22 抓捕 攻击性强的恐龙','23 棱背龙的防御系统','24 水陆两用装甲车','25 混入海底城堡','26 话痨相逢','27 恐龙的血液','28 出师未捷','29 水滴石穿','30 戴夫卡住了','31 通风管道大逃生','32 从天而降的救兵','33 大战冰脊龙','34 逃之夭夭','35 邪恶计划','36 建造穿越轨道','37 离开侏罗纪','38 毁灭植物镇？','39 僵尸变异啦','40 紧急撤退','41 戴夫回来了！','42 狼狈的僵尸博士'
          ]},
        {finished: true, type:'audio', name:"寻宝侏罗纪", img:"/img/book/PlantsZombies/寻宝侏罗纪.jpg", detail:"向日葵梦想成为一名宝藏猎人，在戴夫的帮助下，她追寻着爷爷的脚步，穿越到亿万年前的侏罗纪，开始了一场神奇的寻宝之旅。在这个时代，向日葵不仅需要跟同样穿越而来的僵尸斗智斗勇，还不得不想办法与众多恐龙相处，一路上向日葵和小伙伴坚果、菜问一起帮助小马门溪龙找妈妈，与剑龙一起逃脱森林火海，还差点儿成为永川龙口中的美食。想办法拥有梦想，是一件幸福的事情，而追逐梦想，则无比艰辛，需要勇气与智慧。在菜问和坚果的帮助下，向日葵能否为了梦想坚持到最后呢?一起来听听看吧!", update:"2025-05-18",list:['01 逃命的小恐龙','02 我的梦想','03 向日葵的藏宝图','04 发错了地方','05 向日葵路遇小希','06 高大的鲸龙','07 哭泣的蛮龙','08 狭路相逢','09 秘密武器，登场','10 二段变身','11 紧急逃生','12 剑龙危机','13 漫天大火','14 以火攻火','15 前往，红杉海','16 凶恶的翼龙','17 悲伤三人组','18 母子重逢','19 宝藏藏深山','20 一步也走不动了','21 大餐揭秘','22 危险陷阱','23 永川龙来啦','24 拯救坚果大行动','25 巨大的蝴蝶?','26 霸王食人花','27 因祸得福','28 洞中有洞','29 宝石守护者','30 刀枪不入','31 新一轮攻击','32 传送阵，打开','33 步入绝境','34 地下河','35 植物镇大英雄']},
        {finished: true, type:'audio', name:"魔力神卡", img:"/img/book/PlantsZombies/魔力神卡.png", detail:"古希腊神话有着弥足轻重的地位，它将现实生活与幻想交织在一起，为人们创造了一个包罗万象的瑰丽世界，具有非凡的文学与艺术魅力。古希腊神话中有哪些著名的天神?他们又有哪些经典的神话故事?和植物小分队一起穿越魔法宝石隧道，来到神秘莫测的奥林波斯山，认识性格迥异的十二天神，一同经历别样的神话故事!", update:"2025-05-29",list:['01.神秘的盒子','02.魔盒里的“宝贝”','03.植物镇大危机','04.魔法宝石隧道','05.奥林波斯派对','06.炉火边的女神','07.守护圣火','08.赫斯提亚的善良神卡','09.雅典娜的头号粉丝','10.天神打架','11.向日葵的妙计','12.城市守护神','13.耶！两张神卡','14.“小偷”天神','15.僵尸博士的歪脑筋','16.植物僵尸大PK','17.发怒的赫尔墨斯','18.护送七弦琴','19.音乐挑战','20.僵尸摇滚乐','21.植物管弦乐','22.奥林波斯山大变样','23.德墨忒尔的伤心事','24.神奇的石榴籽','25.宙斯的决断','26.阿瑞斯的比武擂台','27.植物小战僵尸','28.勇气神卡','29.寻找下一张神卡','30.跛脚的天神','31.火神的烦恼','32.璀璨的礼物','33.赫拉回心转意','34.特别的婚礼','35.金苹果之争','36.最美的女神（上）','37.最美的女神（下）','38.美丽神卡','39.冒牌先知','40.狩猎女神的原则','41.一个新祭司','42.爱记仇的赫拉','43.煽风点火','44.赫拉造反','45.第十一张神卡','46.希望钥匙','47.僵尸的报应','48.拯救植物镇']},
        {finished: true, type:'audio', name:"植物侦探团", img:"/img/book/PlantsZombies/植物侦探团.jpg", detail:"植物学校即将组建兴趣社团，豌豆射手凭借自己超强的分析推理能力，征服了所有同学，拿到了首个建团名额，成立了一个无比神奇的社团--植物侦探团。向日葵、菜问都凭借过人的本领成了侦探团的首批成员，坚果却被拒之门外……为了加人社团，坚果必须找到三个案件，他能成功吗?", update:"2025-06-11",list:['01.创意社团征集','02.遭遇质疑','03.推理，大显身手（上)','04.推理，大显身手（下）','05.第一名成员','06.三人侦探团','07.第一个案件，出现','08.案情回溯中','09.可疑的僵尸二人组','10.引发了争端','11.警长和大法官','12.公开庭审（上）','13.公开庭审（下）','14.豌豆射手，出马！','15.反客为主！','16.精彩的攻防对垒','17.校长的真实身份','18.戒指，找到了！','19.推理的过程','20.坚果继续努力','21.太阳神僵尸的吆喝','22.一喝就聪明营养液','23.铁丝能点燃？','24.蚂蚁会写字？','25.书费变葫芦','26.又来十个宝葫芦','27.复制实验','28.案件告破！','29.同一事件，不同版本','30.丁香几个花瓣','31.自由市场上的法庭','32.油能溶于水吗？','33.金币的真正主人','34.正义，不求回报']},
        {finished: true, type:'audio', name:"全能大侦探", img:"/img/book/PlantsZombies/全能大侦探.jpg", detail:"在第1季《植物侦探团》的故事里，植物侦探团成功破获了戒指失踪案，营养液案、钱包归属案三大案件。豌豆射手的植物侦探团可谓声名鹊起。今年，植物学校竟然聘用了一位僵尸--舞者僵尸当外聘老师，随后就发生了失踪案，绑架案.….这些案件的背后到底隐藏着什么可怕的阴谋?豌豆射手的植物侦探团绝不能袖手旁观，这次，他们能破解真相吗?", update:"2025-06-18",list:['01.来了明星教师（上）','02.来了明星教师（下）','03.小喷菇，失踪了？','04.曲折的小巷','05.防盗门的密码','06.摩擦起电与摩擦力','07.小喷菇是安全的！','08.抓住了，跟踪者！','09.冰箱里藏着的线索','10. 重走模拟路线','11.旧仓库血迹斑斑','12.小路旁的雪橇车','13.仗义的雪橇车僵尸','14.破案的全过程','15.向校长道歉','16. 真正的绑架案','17.戴夫的宝藏仓库（上）','18. 戴夫的宝藏仓库（下）','19.万吨手环','20. 最适合的探案道具','21.消极破案','22.吃遍所有餐馆','23.五个图案的真正含义','24.独角鳄鱼？','25.过河的危险','26.渡河计划','27.草丛里，有蛇？','28.陡然生变','29. 浮潜僵尸','30.惊现案中案！','31. 让石头飞一会儿','32. 勇猛无敌的菜问','33.寻找坐标的路','34.第六棵树','35.吊在树上的舞者僵尸','36.太阳窝棚过夜','37.自导自演的恶作剧','38.杠杆原理','39.海边城堡旅馆','40.粗中有细的菜问','41.去而复返','42.201,202房间','43. 夹层中的密室','44.隐蔽的机关','45.麻醉喷罐','46.甬道的尽头','47.找到了，仙人掌','48.初战告捷','49.有原则的僵尸','50.僵尸博士的真正阴谋','51.侦探团，再度出马','52.混元霹雳太水门门主','53.营养液？大力丸？','54.豪华大擂台','55.击掌为誓','56.观众挑战大力士？','57.拔河（上）','58.拔河（下）','59.掌门登台','60.太水门的拳法','61.坚果被选中了！','62.一招打倒十四人','63.决斗开始','64.意料之中','65.神秘的颁奖嘉宾','66.一石激起千层浪','67. 周旋（上）','68. 周旋（下）','69.案件重现','70.骗子的伎俩','71.全是假的','72.假拳案！结案陈词','73.免费送鸡蛋？','74.“微服私访”（上）','75.“微服私访”（中）','76. “微服私访”（下）','77.养生？骗局！','78.全员VIP 1','79.列队欢迎','80.开始套路','81.体验！VIP服务','82.属于自己的星星（上）','83.属于自己的星星（下）','84.这里有熟人','85.理疗第一阶段','86.中途的诱惑','87. 抵达！冥想之城','88.冥想小屋','89.越来越多的线索','90.无根之水和天上飞花','91.虚弱的倭瓜厨师','92.开启撤退计划','93.休闲区体验（上）','94.休闲区体验（下）','95. 休闲区的高消费','96.可怕的高利贷','97.微信！布置任务','98.车轮上的黄色粉末','99.公路上绕圈圈','100.车到悬崖','101.警报拉响','102.惊险！夺城门','103.抢夺遥控器','104. 战斗，初步胜利！','105.自食恶果','106.突然停车了','107.不惜开战','108.最坏的情况','109.临时法庭再登场','110.证词（上）','111.证词（下）','112.神奇的排毒','113.电解水实验','114.气体的真正成分','115. 神秘老者登场','116.不见棺材不掉泪','117.揭露连环骗局','118.血泪控诉（上）','119.血泪控诉（下）','120.宣判！正义时刻']},
        {finished: true, type:'audio', name:"冰雪大作战", img:"/img/book/PlantsZombies/冰雪大作战.jpg", detail:"冬天来了，冰雪大赛也即将举办，植物们摩拳擦掌，踊跃报名。为了能够在比赛中取得好成绩，植物们积极投入了如火如荼的训练，没想到，僵尸却来捣乱了!原来，僵尸们听说这次冰雪大赛设立了一个大奖，为了拿到奖品，贪心的僵尸处处和植物们作对，干扰他们的训练和比赛。僵尸们的诡计会不会得逞?最终的大奖到底是什么?《植物大战僵尸之冰雪大作战》，属于孩子们的运动时间，正式开启!", update:"2025-07-03",list:['第1集 冰雪大赛','第2集 组团参赛','第3集 意外惊喜','第4集 滑雪场地','第5集 仙女雪山','第6集 新手上路','第7集 不速之客','第8集 比赛输了','第9集 冰雪之王','第10集 拜师学艺','第11集 “现代张良”','第12集 冰湖捕鱼','第13集 僵尸博士','第14集 神秘雪坑','第15集 针锋相对','第16集 雕虫小技','第17集 偷梁换柱','第18集 完璧归赵','第19集 新的挑战','第20集 摔跤技巧','第21集 班门弄斧','第22集 自作自受','第23集 自有妙计','第24集 故弄玄虚','第25集 弄巧成拙','第26集 早鸟计划','第27集 意外落水','第28集 简易雪橇','第29集 秘密武器','第30集 一争高下','第31集 团结一心','第32集 大幕拉开','第33集 激烈抢答','第34集 迷路森林','第35集 差点上当','第36集 兵不厌诈','第37集 勇争第一','第38集 出乎意料','第39集 最靓的崽','第40集 冤家路窄','第41集 你争我抢','第42集 圣诞老人','第43集 超级弯道','第44集 热带雪橇','第45集 最终冠军']},
        {finished: true, type:'audio', name:"爆笑昆虫记", img:"/img/book/PlantsZombies/爆笑昆虫记.jpg", detail:"植物镇正在举行滑轮大赛,无数白色的茧突然从天而降。哎呀呀,不好!是僵尸战队和他们的昆虫大军来袭击了!这些虫子接二连三地进攻着植物镇。植物小分队会怎么做呢?他们想啊想，决定利用植物和昆虫的特性,来迎战僵尸战队。这场对决中呀,那真是有惊险又刺激,还.....很搞笑!", update:"2025-08-03",list:['第1集 赛场上的奇怪白茧','第2集 行军虫围攻记','第3集 虫虫会法术！','第4集 羽化成蛾','第5集 休想控制我们！','第6集 飞蛾毒粉','第7集 突袭','第8集 被冻住的蝗虫们','第9集 闪电也疯狂','第10集 臭炮神威力大','第11集 房子轰塌事件','第12集 烈焰毒炮','第13集 尝尝我的铁拳','第14集 马桶式升级器','第15集 炮弹甲虫的火力','第16集 化为乌有','第17集 疯狂马拉松','第18集 诡异的小镇','第19集 僵尸的阴谋','第20集 豌豆射手的秘密武器','第21集 天敌来啦','第22集 僵尸博士新发明','第23集 神秘的陷阱大师','第24集 窝瓜一蹦僵尸痛','第25集 暴风雨前的宁静','第26集 可疑的大水管','第27集 铁掌水上漂','第28集 僵尸的水上芭蕾','第29集 卧底的喇叭嘴水黾','第30集 连环臭屁','第31集 大自然的清道夫','第32集 六只眼睛的虫脸','第33集 完美的变身药水','第34集 撒网！','第35集 笑成一团','第36集 可恶的蛀书贼','第37集 从天而降的机械飞鸟','第38集 食鸟绿巨人——披甲树螽','第39集 难闻的毒液','第40集 升级变身药水','第41集 隐身术','第42集 菜问变雕塑','第43集 伪装大师','第44集 智能树蜥车','第45集 昆虫标本','第46集 新娘还是将军？','第47集 武者永不屈服','第48集 迷宫乱网','第49集 呆萌卧底','第50集 秘密武器','第51集 棋逢对手','第52集 大乌龙','第53集 分身有术','第54集 博士被吃掉了？','第55集 蜜蜂反击战','第56集 美味的蜂蜜','第57集 灭蜂小分队','第58集 两只小蜜蜂','第59集 隧道挖掘赛','第60集 会跑的花儿','第61集 唧唧蝇与睡眠病','第62集 螳螂之王','第63集 食虫军团','第64集 枯叶与小汽车','第65集 最重的蜘蛛','第66集 最大的飞蛾','第67集 远古昆虫','第68集 蜈蚣挖基地','第69集 一亿年前的影帝','第70集 不晒太阳会生病','第71集 满地打滚','第72集 秘方','第73集 变异了！','第74集 误打误撞','第75集 好饿！','第76集 要饭大队','第77集 风波再起','第78集 “友谊号”','第79集 巨船vs巨怪','第80集 全新变身计划']},
        
    ]},
    {
      name: '名著故事', 
      path:'/Classic', 
      list:[      
        {finished: true, type:'audio', name:"80天环游地球", img:"/img/book/Classic/80天环游地球.jpg", detail:"《八十天环游地球》是法国著名作家“科幻小说之父”儒勒·凡尔纳最受欢迎的长篇小说之一。这个故事说的是100多年前，英国有位先生叫福格，他要挑战一个不可能的任务，那就是用80天的时间绕地球一圈。当时的所有人，都觉得这位先生在吹牛。那么这位先生后来完成了这个任务吗？他在旅途中发生了哪些稀奇古怪的事情呢？", update:"2025-07-28", list: ['故事1：一场让人吃惊的打赌','故事2：新仆人被他的主人吓坏了','故事3：警探认为福格先生是小偷','故事4：警探没有逮捕证','故事5：万事通把警探当成好朋友','故事6：在孟买发生的奇怪事','故事7：福格先生买了只大象','故事8：森林里遇到可怕的人','故事9：要被烧死的女人','故事10：他们被警察抓了起来','故事11：主人为万事通付了一大笔钱','故事12：菲克斯警探又跟上了他们','故事13：菲克斯的身份好像被看穿','故事14：晚了24小时到香港','故事15：万事通被灌醉耽误了大事','故事16：福格先生打算坐小船去上海','故事17：小帆船遇到了大风暴','故事18：万事通成了横滨街头的流浪汉','故事19：长鼻子的万事通','故事20：万事通和菲克斯仇人相见','故事21：一场可怕的选举','故事22：野牛挡住了火车','故事23：阿乌达看见了不想见到的人','故事24：火车前面的桥快塌了','故事25：福格先生要和上校决斗','故事26：强盗爬上了火车','故事27：福格去强盗那儿找万事通','故事28：去纽约的艰难路程','故事29：遇到去法国的小船','故事30：福格先生自己开起了船','故事31：福格先生想要烧船','故事32：福格又被警察抓起来了','故事33：福格和阿乌达表达爱意','故事34：俱乐部里焦急的等待','故事35：大结局']},
        {finished: true, type:'audio', name:"金银岛", img:"/img/book/Classic/金银岛.jpg", detail:"《金银岛》的作者是英国的罗伯特·史蒂文森。故事的主人公是个十岁大的小男孩吉姆，他因为一个偶然的机会，得到了一张藏宝图。兴奋的小男孩决定和镇上的医生一同出海去一个小岛上寻找宝藏。他们还找来了一批水手，想让他们帮着一起去寻宝。后来，在这群寻宝人之间，发生了一系列惊险刺激的故事。", update:"2025-06-18",list:['故事1：奇怪的客人','故事2：神秘的水手箱','故事3：危险的旅店','故事4：油布包里的藏宝图','故事5：出发前的准备','故事6：瘸腿水手和黑狗','故事7：船长的担心','故事8：神秘的西尔弗','故事9：一场巨大的危机','故事10：看见小岛','故事11：偷偷上岛','故事12：荒岛探险','故事13：被流放的海盗','故事14：和伙伴重逢','故事15：一个新伙伴','故事16：紧张的登岛之旅','故事17：第一次交战','故事18：致命的危机','故事19：西尔弗来谈判了','故事20：寨子被攻击','故事21：胜利的代价','故事22：找到小船','故事23：砍断大船的缆绳','故事24：海上漂流','故事25：登上大船','故事26：吉姆船长','故事27：鹿死谁手','故事28：回到寨子','故事29：西尔弗投降','故事30：海盗内讧','故事31：医生来了','故事32：海盗寻宝','故事33：树林里的怪声','故事34：消失的宝藏','故事35：宝藏的下落','故事36：大结局']},
        {finished: true, type:'audio', name:"神秘岛", img:"/img/book/Classic/神秘岛.jpg", detail:"《神秘岛》是法国科幻小说家儒勒·凡尔纳创作的长篇小说，是其三部曲的第三部。故事叙述在美国南北战争时期，几个被困在南军中的北方人，中途被风暴吹落在太平洋中的一个荒岛上，他们团结互助，建立起幸福的生活；直到格兰特船长的儿子罗伯尔所指挥的“邓肯号” 经过那里时，才把他们搭救。", update:"2025-07-08", list: ['神秘岛1：狂风中的氢气球','神秘岛2：有人不见了','神秘岛3：危险的逃跑计划','神秘岛4：小岛上的呼唤','神秘岛5：游到对岸','神秘岛6：叫“烟囱”的新家','神秘岛7：消失的火柴盒','神秘岛8：清点物资','神秘岛9：钓松鸡','神秘岛10：暴风雨来临','神秘岛11：沙丘里的秘密','神秘岛12：死里逃生','神秘岛13：神秘的脚印','神秘岛14：没有火，打猎有用么？','神秘岛15：登山探路','神秘岛16：征服者','神秘岛17：前面在冒烟','神秘岛18：造弓箭烧砖头','神秘岛19：测算小岛的位置','神秘岛20：快乐的铁匠','神秘岛21：托普和“美人鱼”搏斗','神秘岛22：发明炸药','神秘岛23：花岗岩宫殿','神秘岛24：改造新家','神秘岛25：珍贵的小麦种子','神秘岛26：一连串怪事','神秘岛27：神秘的箱子','神秘岛28：搜索落难人','神秘岛29：西海岸之旅','神秘岛30：发现老朋友','神秘岛31：入侵者','神秘岛32：新伙伴','神秘岛33：捕鲸船玛利亚号','神秘岛34：眺望岗被袭击','神秘岛35：森林里小木屋','神秘岛36：带回野人','神秘岛37：难以捉摸的野人','神秘岛38：野人的过去','神秘岛39：天大的遗憾','神秘岛40：有船来了','神秘岛41：登船计划','神秘岛42：和海盗开战','神秘岛43：集体撤退','神秘岛44：沉船之谜','神秘岛45：做好事的神秘人','神秘岛46：危机四伏的小岛','神秘岛47：和海盗搏斗','神秘岛48：又有坏消息','神秘岛49：眺望岗着火','神秘岛50：从天而降的神秘物','神秘岛51：再次探险','神秘岛52：发现海盗','神秘岛53：寻找神秘人','神秘岛54：神秘的电报','神秘岛55：原来是他！','神秘岛56：揭秘真相','神秘岛57：永远地告别','神秘岛58：火山喷发','神秘岛59：灭顶之灾','神秘岛60：陷入绝望','神秘岛61：大结局']},
        {finished: true, type:'audio', name:"格列佛游记", img:"/img/book/Classic/格列佛游记.jpg", detail:"《格列佛历险记》，是英国作家乔纳森·斯威夫特创作的一部长篇游记体讽刺小说，它讲述了一个叫格列佛的小伙子，一直怀揣着航海梦。为了实现梦想，格列佛数次离开家乡出门远游。在乘船出海的途中，格列佛遇到了各种各样意外，流落到了许多不为人知的奇特国家，大人国，小人国，飞岛国，马国。未知的旅途危险重重，格列佛的生命频频遭受威胁，聪明勇敢的他该如何渡过难关呢?", update:"2025-07-18", list: ['故事1：惊险的航海旅行（上）','故事2：惊险的航海旅行（下）','故事3：误闯小人国（上）','故事4：误闯小人国（下）','故事5：前往京城（上）','故事6：前往京城（下）','故事7：口袋里的秘密（上）','故事8：口袋里的秘密（下）','故事9：荒唐的危险游戏（上）','故事10：荒唐的危险游戏（下）','故事11：重获自由（上）','故事12：重获自由（下）','故事13：小人国的危机（上）','故事14：小人国的危机（下）','故事15：英雄巨人山（上）','故事16：英雄巨人山（下）','故事17：王宫救火大显身手（上）','故事18：王宫救火大显身手（下）','故事19：可怕的报复（上）','故事20：可怕的报复（下）','故事21：离开小人国（上）','故事22：离开小人国（下）','故事23：大人国奇遇（上）','故事24：大人国奇遇（下）','故事25：可怕的午餐时间（上）','故事26：可怕的午餐时间（下）','故事27：决战大老鼠（上）','故事28：决战大老鼠（下）','故事29：痛苦的卖艺生活（上）','故事30：痛苦的卖艺生活（下）','故事31：脱离苦海（上）','故事32：脱离苦海（下）','故事33：王宫里的新生活（上）','故事34：王宫里的新生活（下）','故事35：被巨人国矮子捉弄（上）','故事36：被巨人国矮子捉弄（下）','故事37：首都一日游（上）','故事38：首都一日游（下）','故事39：危险的生活（上）','故事40：危险的生活（下）','故事41：小矮人闹出大笑话（上）','故事42：小矮人闹出大笑话（下）','故事43：格列佛的祖国（上）','故事44：格列佛的祖国（下）','故事45：飞来横祸（上）','故事46：飞来横祸（下）','故事47：惊险的木箱漂流（上）','故事48：惊险的木箱漂流（下）','故事49：异样的回归（上）','故事50：异样的回归（下）','故事51：海盗夺船（上）','故事52：海盗夺船（下）','故事53：飞岛国奇遇（上）','故事54：飞岛国奇遇（下）','故事55：地洞里的秘密（上）','故事56：地洞里的秘密（下）','故事57：国王镇压动乱（上）','故事58：国王镇压动乱（下）','故事59：首都人都是糊涂蛋（上）','故事60：首都人都是糊涂蛋（下）','故事61：荒唐的科学研究（上）','故事62：荒唐的科学研究（下）','故事63：登上巫师岛（上）','故事64：登上巫师岛（下）','故事65：召见历史上的名人（上）','故事66：召见历史上的名人（下）','故事67：舔地面上的尘土（上）','故事68：舔地面上的尘土（下）','故事69：神秘的布鲁格人（上）','故事70：神秘的布鲁格人（下）','故事71：遭遇海盗（上）','故事72：遭遇海盗（下）','故事73：古怪的动物（上）','故事74：古怪的动物（下）','故事75：马儿统治的慧骃国（上）','故事76：马儿统治的慧骃国（下）','故事77：留在慧骃国（上）','故事78：留在慧骃国（下）','故事79：格列佛介绍祖国（上）','故事80：格列佛介绍祖国（下）','故事81：野胡们的恶习（上）','故事82：野胡们的恶习（下）','故事83：慧骃的美德（上）','故事84：慧骃的美德（下）','故事85：悲伤的分离（上）','故事86：悲伤的分离（下）','故事87：漂泊的格列佛（上）','故事88：漂泊的格列佛（下）','故事89：大结局（上）','故事90：大结局（下）']},
      ]
    },
    {
      name: '墨多多谜境冒险', 
      path:'/MoDuoDuo', 
      list:[      
        {finished: true, type:'audio', name:"黑贝街奇遇", img:"/img/book/MoDuoDuo/黑贝街奇遇.jpg", detail:"《查理九世：1.黑贝街奇遇》墨多多谜境冒险系列。", update:"2025-07-12", list: ['引子 黑贝街的传说','第1集 “问题多多”和外星怪狗（一）','第2集 “问题多多”和外星怪狗（二）','解谜小剧场1 妈妈的禁足令','第3集 不及格的名侦探（一）','第4集 不及格的名侦探（二）','解谜小剧场2 婷婷的提示','第5集 来路不明的赠礼（一）','解谜小剧场3 日记密码','第6集 来路不明的赠礼（二）','第7集 来路不明的赠礼（三）','第8集 丢不掉的日记（一）','解谜小剧场4 不可能出现的东西','第9集 丢不掉的日记（二）','第10集 神秘来电（一）','第11集 神秘来电（二）','解谜小剧场5 神秘来电','第12集 满是眼睛的藏宝图（一）','解谜小剧场6 藏宝地点','第13集 满是眼睛的藏宝图（二）','第14集 传说中的老宅（一）','第15集 传说中的老宅（二）','解谜小剧场7 警卫室的线索','第16集 说谎的警卫（一）','第17集 说谎的警卫（二）','解谜小剧场8 奇怪的公寓楼','第18集 被封印的眼睛（一）','第19集 被封印的眼睛（二）','解谜小剧场9 铁门上的电子锁','第20集 迷失在黑暗回廊（一）','第21集 迷失在黑暗回廊（二）','解谜小剧场10 老宅密道','第22集 手臂上的眼睛（一）','解谜小剧场11 有人居住的老宅','第23集 手臂上的眼睛（二）','第24集 不存在的房间（一）','第25集 不存在的房间（二）','解谜小剧场12 走廊探秘','第26集 诡异的童谣（一）','第27集 诡异的童谣（二）','第28集 诡异的童谣（三）','解谜小剧场13 救命的房间','第29集 虚构的平安（一）','第30集 虚构的平安（二）','解谜小剧场14 可疑短信','第31集 日记的警示（一）','第32集 日记的警示（二）','解谜小剧场15 黑袍人的真面目','第33集 被遗忘的真相（一）','第34集 被遗忘的真相（二）','解谜小剧场16 日记的主人','第35集 沉睡的地下室（一）','第36集 沉睡的地下室（二）','第37集 沉睡的地下室（三）','解谜小剧场17 地下室的秘密','第38集 失踪的画家之谜（一）','第39集 失踪的画家之谜（二）','解谜小剧场18 逃脱的方法','第40集 谜样的房间（一）','第41集 谜样的房间（二）','第42集 谜样的房间（三）','解谜小剧场19 玻璃机关之谜','第43集 我无知可爱的小生命们（一）','第44集 我无知可爱的小生命们（二）','第45集 我无知可爱的小生命们（三）','解谜小剧场20 炸弹按钮','第46集 尾声（一）','第47集 尾声（二）']},
        {finished: true, type:'audio', name:"隐匿的巫女面具", img:"/img/book/MoDuoDuo/隐匿的巫女面具.jpg", detail:"《查理九世：2.隐匿的巫女面具》墨多多谜境冒险系列。", update:"2025-08-12", list:  ['引子 召唤巫女','第1集 巫女来了（一）','第2集 巫女来了（二）','第3集 巫女来了（三）','解谜小剧场1 字条留言','第4集 旧楼里的神秘面具（一）','解谜小剧场2 不同寻常的地方','第5集 旧楼里的神秘面具（二）','第6集 旧楼里的神秘面具（三）','第7集 梦想成真的疑惑（一）','第8集 梦想成真的疑惑（二）','解谜小剧场3 突然取消的考试','第9集 家访的噩梦（一）','第10集 家访的噩梦（二）','解谜小剧场4 数学作业','第11集 三个面具的故事（一）','第12集 三个面具的故事（二）','解谜小剧场5 林老师的秘密','第13集 雨中消失的魔女（一）','第14集 雨中消失的魔女（二）','解谜小剧场6 公寓的位置','第15集 雨中消失的魔女（三）','第16集 背后的眼睛（一）','解谜小剧场7 婷婷的记忆','第17集 背后的眼睛（二）','第18集 背后的眼睛（三）','第19集 数字暗语与校长的留言（一）','第20集 数字暗语与校长的留言（二）','解谜小剧场8 校长的留言','第21集 下一个是谁（一）','第22集 下一个是谁（二）','第23集 下一个是谁（三）','解谜小剧场9 八点半先生的谎言','第24集 形迹可疑的黑边帽（一）','第25集 形迹可疑的黑边帽（二）','解谜小剧场10 背后的跟踪者','第26集 形迹可疑的黑边帽（三）','第27集 深巷魅影（一）','解谜小剧场11 逆转跟踪','第28集 深巷魅影（二）','第29集 深巷魅影（三）','第30集 第二个跟踪者（一）','第31集 第二个跟踪者（二）','第32集 第二个跟踪者（三）','解谜小剧场12 第二个跟踪者','第33集 反巫女同盟的诡计（一）','第34集 反巫女同盟的诡计（二）','第35集 反巫女同盟的诡计（三）','解谜小剧场13 门口的发现','第36集 恐怖的敲门声（一）','解谜小剧场14 相似的图案','第37集 恐怖的敲门声（二）','第38集 诡异的楼梯（一）','第39集 诡异的楼梯（二）','第40集 诡异的楼梯（三）','解谜小剧场15 火柴盒上的线索','第41集 月夜闪光的房间（一）','解谜小剧场16 闪光的房间','第42集 月夜闪光的房间（二）','第43集 归来的校长大人（一）','解谜小剧场17 手铐密码','第44集 归来的校长大人（二）','第45集 坏运气与危险同行（一）','第46集 坏运气与危险同行（二）','解谜小剧场18 颠倒的留言','第47集 正义与邪恶的对抗（一）','第48集 正义与邪恶的对抗（二）','解谜小剧场19 坏蛋们的危机','第49集 真相大白（一）','第50集 真相大白（二）','第51集 真相大白（三）','解谜小剧场20 糊涂的警官','第52集 尾声']},
        {finished: true, type:'audio', name:"乌鸦城的诡局", img:"/img/book/MoDuoDuo/乌鸦城的诡局.jpg", detail:"《查理九世：3.乌鸦城的诡局》墨多多谜境冒险系列。", update:"2025-08-23", list:  ['引子 乌鸦','第1集 乌鸦城的守则（一）','解谜小剧场1 姑姑的年龄','第2集 乌鸦城的守则（二）','第3集 乌鸦城的守则（三）','第4集 九哥哥的名言（一）','解谜小剧场2 神结的解法','第5集 九哥哥的名言（二）','第6集 九哥哥的名言（三）','第7集 捕捉噩梦的神器（一）','解谜小剧场3 姑姑的考题','第8集 捕捉噩梦的神器（二）','第9集 捕捉噩梦的神器（三）','第10集 捕捉噩梦的神器（四）','第11集 没有独角仙的树林（一）','第12集 没有独角仙的树林（二）','第13集 没有独角仙的树林（三）','第14集 没有独角仙的树林（四）','解谜小剧场4 独角仙之谜','第15集 红土地的守护者（一）','第16集 红土地的守护者（二）','解谜小剧场5 九哥哥的谎言','第17集 红土地的守护者（三）','第18集 半夜的神秘来访者（一）','第19集 半夜的神秘来访者（二）','第20集 半夜的神秘来访者（三）','解谜小剧场6 虚设的板凳','第21集 行为诡异的姑姑（一）','第22集 行为诡异的姑姑（二）','解谜小剧场7 关门的方法','第23集 鸦神的三个预言（一）','解谜小剧场8 预言的关键词','第24集 鸦神的三个预言（二）','第25集 鸦神的三个预言（三）','第26集 身份不明的大祭司（一）','第27集 身份不明的大祭司（二）','第28集 身份不明的大祭司（三）','解谜小剧场9 大祭司的手法','第29章 满月的夜明珠（一）','第30集 满月的夜明珠（二）','第31集 满月的夜明珠（三）','解谜小剧场10 镇长的话','第32集 秘境的警钟敲响（一）','解谜小剧场11 大祭司的身份','第33集 秘境的警钟敲响（二）','第34集 消失的秘宝之谜（一）','第35集 消失的秘宝之谜（二）','第36集 消失的秘宝之谜（三）','解谜小剧场12 童谣的秘密','第37集 心跳的选择题（一）','解谜小剧场13 随身工具','第38集 心跳的选择题（二）','第39集 暗河魅影（一）','第40集 暗河魅影（二）','解谜小剧场14 乌鸦城石碑','第41集 暗河魅影（三）','第42集 勇者的神秘机关（一）','解谜小剧场15 前进的机关','第43集 勇者的神秘机关（二）','第44集 勇气与坚持 （一）','解谜小剧场16 盗墓贼的留言','第45集 勇气与坚持（二）','第46集 勇气与坚持 （三）','第47集 空箱子（一）','解谜小剧场17 底座花纹','第48集 空箱子（二）','第49集 空箱子（三）','第50集 猎户座的奇迹（一）','解谜小剧场18 猎户座之谜','第51集 猎户座的奇迹（二）','第52集 猎户座的奇迹（三）','第53集 猎户座的奇迹（四）','第54集 父亲的心愿（一）','第55集 父亲的心愿（二）','第56集 父亲的心愿（三）','第57集 父亲的心愿（四）','解谜小剧场19 消失的方法','第58集 失而复得的珍宝（一）','第59集 失而复得的珍宝（二）','解谜小剧场20 伪装的珍宝','第60集 失而复得的珍宝（三）','第61集 失而复得的珍宝（四）','第62集 失而复得的珍宝（五）','第63集 尾声（一）','第64集 尾声（二）']},
        {finished: true, type:'audio', name:"法老王之心", img:"/img/book/MoDuoDuo/法老王之心.jpg", detail:"《查理九世：4.法老王之心》墨多多谜境冒险系列。", update:"2025-09-23", list:  ['引子 法老王的诅咒','第1集 藏在展柜中的埃及少女（一）','第2集 藏在展柜中的埃及少女（二）','第3集 藏在展柜中的埃及少女（三）','第4集 藏在展柜中的埃及少女（四）','解谜小剧场1 多多的悖论','第5集 首饰盒上的求救信号（一）','第6集 首饰盒上的求救信号（二）','第7集 法老王之墓（一）','第8集 法老王之墓（二）','第9集 法老王之墓（三）','解谜小剧场2 天平砝码','第10集 阿努比斯的天平（一）','第11集 阿努比斯的天平（二）','解谜小剧场3 超重的心脏','第12集 木乃伊的谎言（一）','第13集 木乃伊的谎言（二）','解谜小剧场4 木乃伊的谎言','第14集 金龟子酷刑（一）','第15集 金龟子酷刑（二）','第16集 四个埃及神（一）','第17集 四个埃及神（二）','第18集 四个埃及神（三）','解谜小剧场5 怪异的守护神','第19集 埃及黑猫与刀疤少年（一）','第20集 埃及黑猫与刀疤少年（二）','第21集 埃及黑猫与刀疤少年（三）','解谜小剧场6 隐藏的证据','第22集 三年前的后续（一）','第23集 三年前的后续（二）','第24集 三年前的后续（三）','第25集 三年前的后续（四）','解谜小剧场7 三年前的那一刻','第26集 绑满绷带的手（一）','第27集 绑满绷带的手（二）','第28集 令人生疑的邀请信（一）','第29集 令人生疑的邀请信（二）','第30集 午夜十二点的抉择（一）','第31集 午夜十二点的抉择（二）','解谜小剧场8 被标记的窗户','第32集 博物馆不眠夜（一）','第33集 博物馆不眠夜（二）','第34集 博物馆不眠夜（三）','第35集 通往另一个世界的台阶（一）','第36集 通往另一个世界的台阶（二）','第37集 通往另一个世界的台阶（三）','解谜小剧场9 小伙伴们的位置','第38集 埋藏的罪恶（一）','第39集 埋藏的罪恶（二）','解谜小剧场10 南翎的谎言','第40集 埋藏的罪恶（三）','第41集 地下盛宴拍卖会（一）','解谜小剧场11 纸片上的信息','第42集 地下盛宴拍卖会（二）','第43集 悲惨的真相（一）','解谜小剧场12 真理之羽','第44集 悲惨的真相（二）','第45集 悲惨的真相（三）','第46集 悲惨的真相（四）','第47集 猫神贝斯特（一）','第48集 猫神贝斯特（二）','第49集 猫神贝斯特（三）','第50集 逃出生天（一）','第51集 逃出生天（二）','第52集 逃出生天（三）','解谜小剧场13 贝斯特的戏码','第53集 灵魂的思念（一）','第54集 灵魂的思念（二）','第55集 灵魂的思念（三）','解谜小剧场14 南教授的年龄','第56集 尾声']},
        {finished: true, type:'audio', name:"消失的医务室", img:"/img/book/MoDuoDuo/消失的医务室.jpg", detail:"《查理九世：5.消失的医务室》墨多多谜境冒险系列。", update:"2025-10-02", list: ['引子 学校禁地','第1集 神秘事件来了（一）','第2集 神秘事件来了（二）','第3集 神秘事件来了（三）','解谜小剧场1 神秘信函','第4集 古怪的卢卡（一）','第5集 古怪的卢卡（二）','第6集 古怪的卢卡（三）','第7集 古怪的卢卡（四）','解谜小剧场2 虎鲨的晚餐','第8集 昂贵的占卜价格（一）','第9集 昂贵的占卜价格（二）','解谜小剧场3 问卢卡问题','第10集 昂贵的占卜价格（三）','第11集 星象盘的预言（一）','第12集 星象盘的预言（二）','第13集 星象盘的预言（三）','解谜小剧场4 折纸的启示','第14集 太阳神的警告（一）','第15集 太阳神的警告（二）','第16集 太阳神的警告（三）','解谜小剧场5 太阳神的高度','第17集 阿里山神蝶（一）','第18集 阿里山神蝶（二）','第19集 阿里山神蝶（三）','解谜小剧场6 神蝶数量','第20集 不存在的楼层（一）','第21集 不存在的楼层（二）','第22集 不存在的楼层（三）','解谜小剧场7 战争故事','第23集 不存在的楼层（四）','第24集 烧焦的医务室（一）','第25集 烧焦的医务室（二）','第26集 烧焦的医务室（三）','解谜小剧场8 万年历','第27集 怪医杰森（一）','第28集 怪医杰森（二）','第29集 怪医杰森（三）','第30集 怪医杰森（四）','第31集 暗藏的密室（一）','第32集 暗藏的密室（二）','第33集 暗藏的密室（三）','解谜小剧场9 奇怪的按钮','第34集 第二十个牺牲者（一）','第35集 第二十个牺牲者（二）','第36集 第二十个牺牲者（三）','解谜小剧场10 盲人摸罐子','第37集 巢（一）','第38集 巢（二）','第39集 暗藏玄机的甜点（一）','第40集 暗藏玄机的甜点（二）','第41集 暗藏玄机的甜点（三）','第42集 八十年前的信徒（一）','第43集 八十年前的信徒（二）','第44集 八十年前的信徒（三）','第45集 婷婷的电话（一）','第46集 婷婷的电话（二）','第47集 婷婷的电话（三）','解谜小剧场11 多多的暗语','第48集 成长的同伴（一）','第49集 成长的同伴（二）','第50集 成长的同伴（三）','第51集 封尘的真相（一）','第52集 封尘的真相（二）','第53集 封尘的真相（三）','解谜小剧场12 装着真相的火柴盒','第54集 “命运石”的挑战（一）','第55集 “命运石”的挑战（二）','第56集 “命运石”的挑战（三）','解谜小剧场13 “命运石”的挑战','第57集 楼层消失之谜（一）','第58集 楼层消失之谜（二）','第59集 楼层消失之谜（三）','第60集 飞蛾勇士（一）','第61集 飞蛾勇士（二）','第62集 飞蛾勇士（三）','第63集 飞蛾勇士（四）','第64集 飞蛾勇士（五）','第65集 飞蛾勇士（六）','解谜小剧场14 飞蛾勇士','第66集 尾声']},
        {finished: true, type:'audio', name:"黑夜的隐族", img:"/img/book/MoDuoDuo/黑夜的隐族.jpg", detail:"《查理九世：6.黑夜的隐族》墨多多谜境冒险系列。", update:"2025-10-27", list: ['引子 墨多多的读后感','第1集 补课班上的话题（一）','第2集 补课班上的话题（二）','第3集 补课班上的话题（三）','解谜小剧场1 婷婷的挑战','第4集 卡玛利拉家族（一）','第5集 卡玛利拉家族（二）','第6集 卡玛利拉家族（三）','第7集 卡玛利拉家族（四）','第8集 奇怪的队伍（一）','第9集 奇怪的队伍（二）','第10集 三百年前的预言（一）','第11集 三百年前的预言（二）','第12集 三百年前的预言（三）','第13集 变幻的荆棘林（一）','第14集 变幻的荆棘林（二）','第15集 变幻的荆棘林（三）','第16集 梦中的雕像（一）','第17集 梦中的雕像（二）','第18集 可疑的家族画像（一）','第19集 可疑的家族画像（二）','第20集 可疑的家族画像（三）','第21集 可疑的家族画像（四）','第22集 哈根管家的待客之道（一）','解谜小剧场2 蝙蝠洞窟','第23集 哈根管家的待客之道（二）','第24集 哈根管家的待客之道（三）','解谜小剧场3 喝饮料的方法','第25集 黑暗中的陌生人（一）','第26集 黑暗中的陌生人（二）','解谜小剧场4 我们的初识','第27集 七（一）','第28集 七（二）','第29集 七（三）','第30集 神奇的预知魔镜（一）','解谜小剧场5 齿轮的运动方向','第31集 神奇的预知魔镜（二）','第32集 神奇的预知魔镜（三）','第33集 神奇的预知魔镜（四）','第34集 客房夜宿（一）','第35集 客房夜宿（二）','第36集 客房夜宿（三）','第37集 西利亚小镇的回忆（一）','解谜小剧场6 查理的真理','第38集 西利亚小镇的回忆（二）','第39集 西利亚小镇的回忆（三）','解谜小剧场7 挨骂的原因','第40集 神秘预言家的暗语（一）','第41集 神秘预言家的暗语（二）','第42集 神秘预言家的暗语（三）','第43集 獒犬（一）','第44集 獒犬（二）','第45集 獒犬（三）','第46集 地板下的求救声（一）','第47集 地板下的求救声（二）','第48集 地板下的求救声（三）','第49集 家族秘辛（一）','第50集 家族秘辛（二）','第51集 家族秘辛（三）','第52集 家族秘辛（四）','解谜小剧场8 艾斯的七位哥哥姐姐','第53集 由悲而生的憎恨（一）','第54集 由悲而生的憎恨（二）','第55集 由悲而生的憎恨（三）','第56集 由悲而生的憎恨（四）','解谜小剧场9 难得的聚会','第57集 来自过去的声音（一）','第58集 来自过去的声音（二）','第59集 来自过去的声音（三）','第60集 来自过去的声音（四）','第61集 凤尾兰徽章（一）','第62集 凤尾兰徽章（二）','第63集 凤尾兰徽章（三）','第64集 凤尾兰徽章（四）','解谜小剧场10 巧取宝石','第65集 尾声']},
      ]
    },
    // {
    //   name: '在线漫画', 
    //   path:'/Comics', 
    //   list:[
    //     {finished: true, type:'pdf', name:"龙珠", img:"/img/pdf/龙珠.jpg", detail:"《龙珠》是日本漫画家鸟山明在《周刊少年JUMP》杂志上从1984年至1995年连载的少年漫画作品。是全世界被改编为游戏次数最多的漫画，从而载入吉尼斯世界纪录。", update:"2025-07-28", 
    //       list: [
    //         {name:'1',content:[{name:'上',file:'1_0.pdf'},{name:'中',file:'1_1.pdf'},{name:'下',file:'1_2.pdf'}]},
    //         {name:'2',content:[{name:'上',file:'2_0.pdf'},{name:'中',file:'2_1.pdf'},{name:'下',file:'2_2.pdf'}]},
    //         {name:'3',content:[{name:'上',file:'3_0.pdf'},{name:'中',file:'3_1.pdf'},{name:'下',file:'3_2.pdf'}]},
    //         {name:'4',content:[{name:'上',file:'4_0.pdf'},{name:'中',file:'4_1.pdf'},{name:'下',file:'4_2.pdf'}]},
    //         {name:'5',content:[{name:'上',file:'5_0.pdf'},{name:'中',file:'5_1.pdf'},{name:'下',file:'5_2.pdf'}]},
    //         {name:'6',content:[{name:'上',file:'6_0.pdf'},{name:'中',file:'6_1.pdf'},{name:'下',file:'6_2.pdf'}]},
    //         {name:'7',content:[{name:'上',file:'7_0.pdf'},{name:'中',file:'7_1.pdf'},{name:'下',file:'7_2.pdf'}]},
    //         {name:'8',content:[{name:'上',file:'8_0.pdf'},{name:'中',file:'8_1.pdf'},{name:'下',file:'8_2.pdf'}]},
    //         {name:'9',content:[{name:'上',file:'9_0.pdf'},{name:'中',file:'9_1.pdf'},{name:'下',file:'9_2.pdf'}]},
    //         {name:'10',content:[{name:'上',file:'10_0.pdf'},{name:'中',file:'10_1.pdf'},{name:'下',file:'10_2.pdf'}]},
    //         {name:'11',content:[{name:'上',file:'11_0.pdf'},{name:'中',file:'11_1.pdf'},{name:'下',file:'11_2.pdf'}]},
    //         {name:'12',content:[{name:'上',file:'12_0.pdf'},{name:'中',file:'12_1.pdf'},{name:'下',file:'12_2.pdf'}]},
    //         {name:'13',content:[{name:'上',file:'13_0.pdf'},{name:'中',file:'13_1.pdf'},{name:'下',file:'13_2.pdf'}]},
    //         {name:'14',content:[{name:'上',file:'14_0.pdf'},{name:'中',file:'14_1.pdf'},{name:'下',file:'14_2.pdf'}]},
    //         {name:'15',content:[{name:'上',file:'15_0.pdf'},{name:'中',file:'15_1.pdf'},{name:'下',file:'15_2.pdf'}]},
    //         {name:'16',content:[{name:'上',file:'16_0.pdf'},{name:'中',file:'16_1.pdf'},{name:'下',file:'16_2.pdf'}]},
    //         {name:'17',content:[{name:'上',file:'17_0.pdf'},{name:'中',file:'17_1.pdf'},{name:'下',file:'17_2.pdf'}]},
    //         {name:'18',content:[{name:'上',file:'18_0.pdf'},{name:'中',file:'18_1.pdf'},{name:'下',file:'18_2.pdf'}]},
    //         {name:'19',content:[{name:'上',file:'19_0.pdf'},{name:'中',file:'19_1.pdf'},{name:'下',file:'19_2.pdf'}]},
    //         {name:'20',content:[{name:'上',file:'20_0.pdf'},{name:'中',file:'20_1.pdf'},{name:'下',file:'20_2.pdf'}]},
    //         {name:'21',content:[{name:'上',file:'21_0.pdf'},{name:'中',file:'21_1.pdf'},{name:'下',file:'21_2.pdf'}]},
    //         {name:'22',content:[{name:'上',file:'22_0.pdf'},{name:'中',file:'22_1.pdf'},{name:'下',file:'22_2.pdf'}]},
    //         {name:'23',content:[{name:'上',file:'23_0.pdf'},{name:'中',file:'23_1.pdf'},{name:'下',file:'23_2.pdf'}]},
    //         {name:'24',content:[{name:'上',file:'24_0.pdf'},{name:'中',file:'24_1.pdf'},{name:'下',file:'24_2.pdf'}]},
    //         {name:'25',content:[{name:'上',file:'25_0.pdf'},{name:'中',file:'25_1.pdf'},{name:'下',file:'25_2.pdf'}]},
    //         {name:'26',content:[{name:'上',file:'26_0.pdf'},{name:'中',file:'26_1.pdf'},{name:'下',file:'26_2.pdf'}]},
    //         {name:'27',content:[{name:'上',file:'27_0.pdf'},{name:'中',file:'27_1.pdf'},{name:'下',file:'27_2.pdf'}]},
    //         {name:'28',content:[{name:'上',file:'28_0.pdf'},{name:'中',file:'28_1.pdf'},{name:'下',file:'28_2.pdf'}]},
    //         {name:'29',content:[{name:'上',file:'29_0.pdf'},{name:'中',file:'29_1.pdf'},{name:'下',file:'29_2.pdf'}]},
    //         {name:'30',content:[{name:'上',file:'30_0.pdf'},{name:'中',file:'30_1.pdf'},{name:'下',file:'30_2.pdf'}]},
    //         {name:'31',content:[{name:'上',file:'31_0.pdf'},{name:'中',file:'31_1.pdf'},{name:'下',file:'31_2.pdf'}]},
    //         {name:'32',content:[{name:'上',file:'32_0.pdf'},{name:'中',file:'32_1.pdf'},{name:'下',file:'32_2.pdf'}]},
    //         {name:'33',content:[{name:'上',file:'33_0.pdf'},{name:'中',file:'33_1.pdf'},{name:'下',file:'33_2.pdf'}]},
    //         {name:'34',content:[{name:'上',file:'34_0.pdf'},{name:'中',file:'34_1.pdf'},{name:'下',file:'34_2.pdf'}]},
    //         {name:'35',content:[{name:'上',file:'35_0.pdf'},{name:'中',file:'35_1.pdf'},{name:'下',file:'35_2.pdf'}]},
    //         {name:'36',content:[{name:'上',file:'36_0.pdf'},{name:'中',file:'36_1.pdf'},{name:'下',file:'36_2.pdf'}]},
    //         {name:'37',content:[{name:'上',file:'37_0.pdf'},{name:'中',file:'37_1.pdf'},{name:'下',file:'37_2.pdf'}]},
    //         {name:'38',content:[{name:'上',file:'38_0.pdf'},{name:'中',file:'38_1.pdf'},{name:'下',file:'38_2.pdf'}]},
    //         {name:'39',content:[{name:'上',file:'39_0.pdf'},{name:'中',file:'39_1.pdf'},{name:'下',file:'39_2.pdf'}]},
    //         {name:'40',content:[{name:'上',file:'40_0.pdf'},{name:'中',file:'40_1.pdf'},{name:'下',file:'40_2.pdf'}]},
    //         {name:'41',content:[{name:'上',file:'41_0.pdf'},{name:'中',file:'41_1.pdf'},{name:'下',file:'41_2.pdf'}]},
    //         {name:'42',content:[{name:'上',file:'42_0.pdf'},{name:'中',file:'42_1.pdf'},{name:'下',file:'42_2.pdf'}]}
    //       ]
    //     },
    //     {finished: false, type:'pdf', name:"火影忍者", img:"/img/pdf/火影忍者.jpg", detail:"《火影忍者》是日本漫画家岸本齐史的漫画作品，于1999年开始连载。", update:"2025-09-03", 
    //       list: [
    //       {name:'1',content:[{name:'上',file:'1_0.pdf'},{name:'中',file:'1_1.pdf'},{name:'下',file:'1_2.pdf'}]},
    //       {name:'2',content:[{name:'上',file:'2_0.pdf'},{name:'中',file:'2_1.pdf'},{name:'下',file:'2_2.pdf'}]},
    //       {name:'3',content:[{name:'上',file:'3_0.pdf'},{name:'中',file:'3_1.pdf'},{name:'下',file:'3_2.pdf'}]},
    //       {name:'4',content:[{name:'上',file:'4_0.pdf'},{name:'中',file:'4_1.pdf'},{name:'下',file:'4_2.pdf'}]},
    //       {name:'5',content:[{name:'上',file:'5_0.pdf'},{name:'中',file:'5_1.pdf'},{name:'下',file:'5_2.pdf'}]},
    //       {name:'6',content:[{name:'上',file:'6_0.pdf'},{name:'中',file:'6_1.pdf'},{name:'下',file:'6_2.pdf'}]},
    //       {name:'7',content:[{name:'上',file:'7_0.pdf'},{name:'中',file:'7_1.pdf'},{name:'下',file:'7_2.pdf'}]},
    //       {name:'8',content:[{name:'上',file:'8_0.pdf'},{name:'中',file:'8_1.pdf'},{name:'下',file:'8_2.pdf'}]},
    //       {name:'9',content:[{name:'上',file:'9_0.pdf'},{name:'中',file:'9_1.pdf'},{name:'下',file:'9_2.pdf'}]},
    //       {name:'10',content:[{name:'上',file:'10_0.pdf'},{name:'中',file:'10_1.pdf'},{name:'下',file:'10_2.pdf'}]},
    //       {name:'11',content:[{name:'上',file:'11_0.pdf'},{name:'中',file:'11_1.pdf'},{name:'下',file:'11_2.pdf'}]},
    //       {name:'12',content:[{name:'上',file:'12_0.pdf'},{name:'中',file:'12_1.pdf'},{name:'下',file:'12_2.pdf'}]},
    //       {name:'13',content:[{name:'上',file:'13_0.pdf'},{name:'中',file:'13_1.pdf'},{name:'下',file:'13_2.pdf'}]},
    //       {name:'14',content:[{name:'上',file:'14_0.pdf'},{name:'中',file:'14_1.pdf'},{name:'下',file:'14_2.pdf'}]},
    //       {name:'15',content:[{name:'上',file:'15_0.pdf'},{name:'中',file:'15_1.pdf'},{name:'下',file:'15_2.pdf'}]},
    //       ]},
    //     {finished: false, type:'pdf', name:"龙珠超", img:"/img/pdf/龙珠超.jpg", detail:"日本国民漫画《龙珠》正统授权续篇《龙珠超》", update:"2025-09-01", 
    //       list: [
    //       {name:'1',content:[{name:'上',file:'1_0.pdf'},{name:'中',file:'1_1.pdf'},{name:'下',file:'1_2.pdf'}]},
    //       ]},
    //     {finished: false, type:'pdf', name:"哆啦A梦", img:"/img/pdf/哆啦A梦.jpg", detail:"大雄，一个学习也不好、运动也不行、自由散漫的小学生。一天，来自22世纪的猫型机器人“哆啦A梦”来到了他的身边。哆啦A梦会从肚子上的四次元口袋里拿出各种各样的“秘密道具”来帮助大雄，可有时竟也会因为大雄的得意忘形以及哆啦A梦冒冒失失的性格，最终演变成异想天开的结局。", update:"2025-07-28", 
    //       list: [
    //         {name:'1',content:[{name:'上',file:'1_0.pdf'},{name:'中',file:'1_1.pdf'},{name:'下',file:'1_2.pdf'}]},
    //         {name:'2',content:[{name:'上',file:'2_0.pdf'},{name:'中',file:'2_1.pdf'},{name:'下',file:'2_2.pdf'}]},
    //         {name:'3',content:[{name:'上',file:'3_0.pdf'},{name:'中',file:'3_1.pdf'},{name:'下',file:'3_2.pdf'}]},
    //         {name:'4',content:[{name:'上',file:'4_0.pdf'},{name:'中',file:'4_1.pdf'},{name:'下',file:'4_2.pdf'}]},
    //         {name:'5',content:[{name:'上',file:'5_0.pdf'},{name:'中',file:'5_1.pdf'},{name:'下',file:'5_2.pdf'}]},
    //         {name:'6',content:[{name:'上',file:'6_0.pdf'},{name:'中',file:'6_1.pdf'},{name:'下',file:'6_2.pdf'}]},
    //         {name:'7',content:[{name:'上',file:'7_0.pdf'},{name:'中',file:'7_1.pdf'},{name:'下',file:'7_2.pdf'}]},
    //         {name:'8',content:[{name:'上',file:'8_0.pdf'},{name:'中',file:'8_1.pdf'},{name:'下',file:'8_2.pdf'}]},
    //         {name:'9',content:[{name:'上',file:'9_0.pdf'},{name:'中',file:'9_1.pdf'},{name:'下',file:'9_2.pdf'}]},
    //         {name:'10',content:[{name:'上',file:'10_0.pdf'},{name:'中',file:'10_1.pdf'},{name:'下',file:'10_2.pdf'}]},
    //         {name:'11',content:[{name:'上',file:'11_0.pdf'},{name:'中',file:'11_1.pdf'},{name:'下',file:'11_2.pdf'}]},
    //         {name:'12',content:[{name:'上',file:'12_0.pdf'},{name:'中',file:'12_1.pdf'},{name:'下',file:'12_2.pdf'}]},
    //         {name:'13',content:[{name:'上',file:'13_0.pdf'},{name:'中',file:'13_1.pdf'},{name:'下',file:'13_2.pdf'}]},
    //         {name:'14',content:[{name:'上',file:'14_0.pdf'},{name:'中',file:'14_1.pdf'},{name:'下',file:'14_2.pdf'}]},
    //         {name:'15',content:[{name:'上',file:'15_0.pdf'},{name:'中',file:'15_1.pdf'},{name:'下',file:'15_2.pdf'}]},
    //         {name:'16',content:[{name:'上',file:'16_0.pdf'},{name:'中',file:'16_1.pdf'},{name:'下',file:'16_2.pdf'}]},
    //         {name:'17',content:[{name:'上',file:'17_0.pdf'},{name:'中',file:'17_1.pdf'},{name:'下',file:'17_2.pdf'}]},
    //         {name:'18',content:[{name:'上',file:'18_0.pdf'},{name:'中',file:'18_1.pdf'},{name:'下',file:'18_2.pdf'}]},
    //       ]},
    //     {finished: true, type:'pdf', name:"阿拉蕾", img:"/img/pdf/阿拉蕾.jpg", detail:"《阿拉蕾》是鸟山明继《龙珠》前的成名作，连载于1980-1984年，奠定了其无厘头幽默风格。故事围绕则卷千兵卫博士发明的机器人阿拉蕾展开，她力大无穷但心智幼稚，与企鹅村的奇葩居民（如吃草莓的超人、尼可家大王等）共同制造混乱，讽刺了当时日本流行文化。‌‌", update:"2025-08-02", 
    //       list: [
    //         {name:'1',content:[{name:'上',file:'1_0.pdf'},{name:'中',file:'1_1.pdf'},{name:'下',file:'1_2.pdf'}]},
    //         {name:'2',content:[{name:'上',file:'2_0.pdf'},{name:'中',file:'2_1.pdf'},{name:'下',file:'2_2.pdf'}]},
    //         {name:'3',content:[{name:'上',file:'3_0.pdf'},{name:'中',file:'3_1.pdf'},{name:'下',file:'3_2.pdf'}]},
    //         {name:'4',content:[{name:'上',file:'4_0.pdf'},{name:'中',file:'4_1.pdf'},{name:'下',file:'4_2.pdf'}]},
    //         {name:'5',content:[{name:'上',file:'5_0.pdf'},{name:'中',file:'5_1.pdf'},{name:'下',file:'5_2.pdf'}]},
    //         {name:'6',content:[{name:'上',file:'6_0.pdf'},{name:'中',file:'6_1.pdf'},{name:'下',file:'6_2.pdf'}]},
    //         {name:'7',content:[{name:'上',file:'7_0.pdf'},{name:'中',file:'7_1.pdf'},{name:'下',file:'7_2.pdf'}]},
    //         {name:'8',content:[{name:'上',file:'8_0.pdf'},{name:'中',file:'8_1.pdf'},{name:'下',file:'8_2.pdf'}]},
    //         {name:'9',content:[{name:'上',file:'9_0.pdf'},{name:'中',file:'9_1.pdf'},{name:'下',file:'9_2.pdf'}]},
    //         {name:'10',content:[{name:'上',file:'10_0.pdf'},{name:'中',file:'10_1.pdf'},{name:'下',file:'10_2.pdf'}]},
    //         {name:'11',content:[{name:'上',file:'11_0.pdf'},{name:'中',file:'11_1.pdf'},{name:'下',file:'11_2.pdf'}]},
    //         {name:'12',content:[{name:'上',file:'12_0.pdf'},{name:'中',file:'12_1.pdf'},{name:'下',file:'12_2.pdf'}]},
    //         {name:'13',content:[{name:'上',file:'13_0.pdf'},{name:'中',file:'13_1.pdf'},{name:'下',file:'13_2.pdf'}]},
    //         {name:'14',content:[{name:'上',file:'14_0.pdf'},{name:'中',file:'14_1.pdf'},{name:'下',file:'14_2.pdf'}]},
    //         {name:'15',content:[{name:'上',file:'15_0.pdf'},{name:'中',file:'15_1.pdf'},{name:'下',file:'15_2.pdf'}]},
    //         {name:'16',content:[{name:'上',file:'16_0.pdf'},{name:'中',file:'16_1.pdf'},{name:'下',file:'16_2.pdf'}]},
    //         {name:'17',content:[{name:'上',file:'17_0.pdf'},{name:'中',file:'17_1.pdf'},{name:'下',file:'17_2.pdf'}]},
    //         {name:'18',content:[{name:'上',file:'18_0.pdf'},{name:'中',file:'18_1.pdf'},{name:'下',file:'18_2.pdf'}]}
    //       ]},
    //     {finished: false, type:'pdf', name:"灌篮高手", img:"/img/pdf/灌篮高手.jpg", detail:"《灌篮高手》是日本漫画家井上雄彦以高中篮球为题材的少年漫画，于《周刊少年Jump》1990年42号~1996年27号上连载，单行本在17个国家和地区发行。与《足球小将》和《棒球英豪》合称为日本运动漫画三大巅峰之作。‌‌", update:"2025-08-16", 
    //       list: [
    //         {name:'1',content:[{name:'上',file:'1_0.pdf'},{name:'中',file:'1_1.pdf'},{name:'下',file:'1_2.pdf'}]},
    //       ]},
    //     {finished: false, type:'pdf', name:"圣斗士星矢", img:"/img/pdf/圣斗士星矢.jpg", detail:"《圣斗士星矢》是日本漫画家车田正美在《周刊少年JUMP》1986年1・2合并号（1985年12月发售）上开始连载的漫画，漫画于1990年49号完结。", update:"2025-09-02", 
    //       list: [
    //         {name:'1',content:[{name:'上',file:'1_0.pdf'},{name:'中',file:'1_1.pdf'},{name:'下',file:'1_2.pdf'}]},
    //       ]},
    //     {finished: false, type:'pdf', name:"棋魂", img:"/img/pdf/棋魂.jpg", detail:"《棋魂》（日语：ヒカルの碁，中文意义为“光的围棋”，“光之棋”）是日本《周刊少年JUMP》（集英社）连载的以围棋为题材的少年漫画。作者是堀田由美（ほったゆみ），漫画由小畑健绘制，并由日本棋院的女棋士梅泽由香里担当监修，‌", update:"2025-08-18", 
    //       list: [
    //         {name:'1',content:[{name:'上',file:'1_0.pdf'},{name:'中',file:'1_1.pdf'},{name:'下',file:'1_2.pdf'}]}
    //       ]},
    //     {finished: false, type:'pdf', name:"浪客剑心", img:"/img/pdf/浪客剑心.jpg", detail:"《浪客剑心 -明治剑客浪漫谭-》（るろうに剣心 -明治剣客浪漫譚-）是日本漫画家和月伸宏于1994年—1999年在日本《周刊少年Jump》上连载的少年漫画，单行本旧版共28卷，完全版共22卷。截止到2020年，漫画单行本的累计发行量已突破7200万册。", update:"2025-08-28", 
    //       list: [
    //         {name:'1',content:[{name:'上',file:'1_0.pdf'},{name:'中',file:'1_1.pdf'},{name:'下',file:'1_2.pdf'}]},
    //       ]},
    //   ]
    // }
  ],
  "study":{
    english: [
      {
        name:"70天搞定初中1600词汇",
        list:[
          {name:"A Young Officer and an Old Soldier", img:"/english/70days/1/1.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-01",  file: '/english/70days/1/1.txt', audio:'/english/70days/1/1.mp3'},
          {name:"Are You Going to Thank Her?", img:"/english/70days/2/2.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-02",  file: '/english/70days/2/2.txt', audio:'/english/70days/2/2.mp3'},
          {name:"Sam and Tod", img:"/english/70days/3/3.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-03",  file: '/english/70days/3/3.txt', audio:'/english/70days/2/3.mp3'},
          {name:"In the Bar", img:"/english/70days/4/4.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-04",  file: '/english/70days/4/4.txt', audio:'/english/70days/4/4.mp3'},
          {name:"Three Black Umbrellas", img:"/english/70days/5/5.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-05",  file: '/english/70days/5/5.txt', audio:'/english/70days/5/5.mp3'},
          {name:"Friends", img:"/english/70days/6/6.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-06",  file: '/english/70days/6/6.txt', audio:'/english/70days/6/6.mp3'},
          {name:'The "Deaf" Wife', img:"/english/70days/7/7.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-07",  file: '/english/70days/7/7.txt', audio:'/english/70days/7/7.mp3'},
          {name:"We Really Don't Know", img:"/english/70days/8/8.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-08",  file: '/english/70days/8/8.txt', audio:'/english/70days/8/8.mp3'},
          {name:"Raymond", img:"/english/70days/9/9.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-09",  file: '/english/70days/9/9.txt', audio:'/english/70days/9/9.mp3'},
          {name:"That's Why!", img:"/english/70days/10/10.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-10",  file: '/english/70days/10/10.txt', audio:'/english/70days/10/10.mp3'},
          {name:"Living like a Pig", img:"/english/70days/11/11.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-11",  file: '/english/70days/11/11.txt', audio:'/english/70days/11/11.mp3'},
          {name:"Greenland and lceland", img:"/english/70days/12/12.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-12",  file: '/english/70days/12/12.txt', audio:'/english/70days/12/12.mp3'},
          {name:"A Competition of Lying", img:"/english/70days/13/13.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-13",  file: '/english/70days/13/13.txt', audio:'/english/70days/13/13.mp3'},
          {name:"Sports in America", img:"/english/70days/14/14.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-14",  file: '/english/70days/14/14.txt', audio:'/english/70days/14/14.mp3'},
          {name:"The Apple Tree", img:"/english/70days/15/15.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-15",  file: '/english/70days/15/15.txt', audio:'/english/70days/15/15.mp3'},
          {name:"Pupils in China ", img:"/english/70days/16/16.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-16",  file: '/english/70days/16/16.txt', audio:'/english/70days/16/16.mp3'},
          {name:"Say it with Flowers", img:"/english/70days/17/17.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-17",  file: '/english/70days/17/17.txt', audio:'/english/70days/17/17.mp3'},
          {name:"Learning by Doing and Going ", img:"/english/70days/18/18.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-18",  file: '/english/70days/18/18.txt', audio:'/english/70days/18/18.mp3'},
          {name:"Jane Came Home too Late ", img:"/english/70days/19/19.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-19",  file: '/english/70days/19/19.txt', audio:'/english/70days/19/19.mp3'},
          {name:"My Son's Questions ", img:"/english/70days/20/20.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-20",  file: '/english/70days/20/20.txt', audio:'/english/70days/20/20.mp3'},
          {name:"I Did a Silly Thing", img:"/english/70days/21/21.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-21",  file: '/english/70days/21/21.txt', audio:'/english/70days/21/21.mp3'},
          {name:"Snakes", img:"/english/70days/22/22.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-22",  file: '/english/70days/22/22.txt', audio:'/english/70days/22/22.mp3'},
          {name:"A Call from the Secretary", img:"/english/70days/23/23.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-23",  file: '/english/70days/23/23.txt', audio:'/english/70days/23/23.mp3'}, 
          {name:"My Collection of Sea Shells", img:"/english/70days/24/24.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-24",  file: '/english/70days/24/24.txt', audio:'/english/70days/24/24.mp3'},
          {name:"Breakfast Is Important", img:"/english/70days/25/25.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-25",  file: '/english/70days/25/25.txt', audio:'/english/70days/25/25.mp3'}, 
          {name:"The Proper Way to Give Gifts", img:"/english/70days/26/26.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-26",  file: '/english/70days/26/26.txt', audio:'/english/70days/26/26.mp3'},
          {name:"Making Electricity", img:"/english/70days/27/27.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-27",  file: '/english/70days/27/27.txt', audio:'/english/70days/27/27.mp3'},
          {name:"One Real Man", img:"/english/70days/28/28.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-28",  file: '/english/70days/28/28.txt', audio:'/english/70days/28/28.mp3'},
          {name:"Where Is My Pet Dog?", img:"/english/70days/29/29.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-29",  file: '/english/70days/29/29.txt', audio:'/english/70days/29/29.mp3'},
          {name:"Why Shouldn't We Smoke?", img:"/english/70days/30/30.jpg", detail:"英语阅读-70篇短文搞定初中1600词汇", update:"2025-06-30",  file: '/english/70days/30/30.txt', audio:'/english/70days/30/30.mp3'},
        ]
      },
      {
        name:"40天搞定高中3500词汇",
        list:[
          {name:"Fall in Love with English", img:"/english/40days/1/1.jpg", detail:"英语阅读-40篇短文搞定高中3500词汇", update:"2025-06-11",  file: '/english/40days/1/1.txt', audio:'/english/40days/1/1.mp3'},
          {name:"Different Countries Have Different Kinds of Englishes", img:"/english/40days/2/2.jpg", detail:"英语阅读-40篇短文搞定高中3500词汇", update:"2025-06-12",  file: '/english/40days/2/2.txt', audio:'/english/40days/2/2.mp3'},
          {name:"A Hard Trip", img:"/english/40days/3/3.jpg", detail:"英语阅读-40篇短文搞定高中3500词汇", update:"2025-06-13",  file: '/english/40days/3/3.txt', audio:'/english/40days/3/3.mp3'},
          {name:"A Horrible Earthquake", img:"/english/40days/4/4.jpg", detail:"英语阅读-40篇短文搞定高中3500词汇", update:"2025-06-14",  file: '/english/40days/4/4.txt', audio:'/english/40days/4/4.mp3'},
          {name:"The Great President", img:"/english/40days/5/5.jpg", detail:"英语阅读-40篇短文搞定高中3500词汇", update:"2025-06-15",  file: '/english/40days/5/5.txt', audio:'/english/40days/5/5.mp3'},
          {name:"A Brave Maid", img:"/english/40days/6/6.jpg", detail:"英语阅读-40篇短文搞定高中3500词汇", update:"2025-06-16",  file: '/english/40days/6/6.txt', audio:'/english/40days/6/6.mp3'},
        ]
      },
      {
        name:'30天搞定英语语法',
        list:[
          {type:'pdf', name:"30天搞定英语语法", img:"/english/30days/30days.jpg", detail:"英语语法超图解 30天用思维导图战胜英语语法", update:"2025-06-12", file:"/english/30days/30days.pdf"},
        ]
      },
    ]
  }
  
}
